{
  "items": [
    {
      "id": "tt1630029",
      "rank": "1",
      "rankUpDown": "+1",
      "title": "Avatar: The Way of Water",
      "fullTitle": "Avatar: The Way of Water (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img0.avif",
      "crew": "James Cameron (dir.), Sam Worthington, Zoe Saldana",
      "imDbRating": "7.8",
      "imDbRatingCount": "274360",
      "plot": "Sixteen years after the Na'vi repelled the RDA invasion of Pandora, Jake Sully lives as chief of the Omatikaya clan, and raises a family with Neytiri, which includes sons Neteyam and Lo'ak, daughter Tuk, and adopted children Kiri (born from Grace Augustine's inert avatar) and Spider, the Pandora-born human son of the late Colonel Miles Quaritch. To the Na'vi's dismay, the RDA, led by their new leader, Frances Ardmore, returns to colonize Pandora as Earth is dying. Among the new arrivals are Recombinants—Na'vi avatars implanted with deceased human soldiers' memories—with Quaritch's recombinant serving as the leader. A year into the occupation, Jake leads a guerilla campaign against the RDA. During a counterinsurgency mission, Quaritch and his subordinates capture Jake's children. Jake and Neytiri arrive and free them, killing several of Quaritch's men, but Spider remains captured by Quaritch, who recognizes him as his son. After the RDA fails to get information from Spider, Quaritch decides to spend time with his son to draw him on his side. In turn, Spider teaches Quaritch about Na'vi culture and language. Aware of the danger posed by Spider's knowledge of his whereabouts, Jake and his family exile themselves from the Omatikaya and retreat to Pandora's eastern seaboard, where the Metkayina clan gives them refuge. There, the family learns the ways of the reef people, Kiri develops a spiritual bond with the sea, and Lo'ak befriends Tsireya, the daughter of chief Tonowari and his wife, Ronal. After defending Kiri against Aonung, Tonowari's son, Lo'ak apologizes at Jake's insistence. Aonung and his friends then entice Lo'ak to a trip into a sea predator's territory and leave him stranded. After being saved from a giant sea beast, Lo'ak is befriended by Payakan, a Tulkun—an intelligent and pacifistic whale-like species whom the Metkayina consider their spiritual brethren. Upon his return, Lo'ak wins Aonung's friendship by taking the blame for the trip but is told that Payakan is an outcast among the Tulkun. Later, Kiri links to the Metkayina's underwater Spirit Tree and spiritually 'meets' her biological mother, Grace, whose consciousness lives within Pandora. During the trance induced by linking to the Spirit Tree, Kiri suffers a seizure and falls unconscious, nearly drowning. Jake summons Norm Spellman and Max Patel for help using their medical equipment, where they diagnose Kiri with epilepsy and warn that she cannot connect to the Spirit Tree again, as doing so may kill her. Although Ronal saves Kiri, Quaritch tracks Norm and Max's aircraft to the archipelago where the Metkayina live. Bringing Spider with him, Quaritch joins forces with the RDA's marine operations, led by Captain Mick Scoresby, and commandeers a whaling vessel that hunts Tulkuns to extract an anti-aging serum called amrita. Quaritch's squad raids the archipelago, interrogating the tribes about Jake's location to no avail. Quaritch then orders the whalers to kill Tulkuns near the villages to draw Jake out. Lo'ak mentally links with Payakan and learns that he was cast out because he went against the pacifist ways of his species and attacked the whalers who killed his mother, causing many deaths. When the Metkayina learns of the Tulkun killings, Lo'ak warns Payakan, followed by his siblings and friends. They find Payakan being hunted, and Quaritch captures Lo'ak, Tsireya, and Tuk. Jake, Neytiri, and the Metkayina set out to confront the humans and rescue the kids. Quaritch forces Jake to surrender, but Payakan attacks the whalers, triggering a fight that kills several crew members, cripples the vessel, and severs Scoresby's arm. Neteyam rescues Lo'ak, Tsireya, and Spider but is fatally shot by Quaritch. Devastated, both parents go back to save their remaining children that were recaptured; upon facing Quaritch's team, Neytiri flies into a grieving rage and brutally murders many of them, accidentally breaking her father's bow in the process. Jake faces Quaritch, who uses Kiri as a hostage, and when Neytiri does the same with Spider, Quaritch at first denies their relationship but desists once Neytiri attempts to kill Spider. Jake, Quaritch, Neytiri, and Tuk are trapped inside the sinking vessel. After a tense skirmish, Jake strangles Quaritch unconscious and is rescued by Lo'ak and Payakan, while Kiri rescues Neytiri and Tuk. Spider rescues Quaritch but refuses to go with him and rejoins Jake's family, at which point he is welcomed as a true son. After Neteyam's funeral, Jake informs Tonowari of his decision to leave the Metkayina. Still, the chief respectfully identifies Jake as part of the clan and welcomes him and his family to stay. Before vowing to resume their campaign against the RDA, Jake and his family accept and live their new life at sea."
    },
    {
      "id": "tt9764362",
      "rank": "2",
      "rankUpDown": "-1",
      "title": "The Menu",
      "fullTitle": "The Menu (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img1.avif",
      "crew": "Mark Mylod (dir.), Ralph Fiennes, Anya Taylor-Joy",
      "imDbRating": "7.2",
      "imDbRatingCount": "202880",
      "plot": "Foodie Tyler Ledford and his date, Margot Mills, travel by boat to Hawthorn, an exclusive restaurant owned and operated by celebrity chef Julian Slowik, located on a private island. The other guests attending the dinner are Lillian Bloom, a food critic; her editor Ted; wealthy regulars Richard and Anne Leibrandt; washed-up movie star George Diaz and his personal assistant Felicity Lynn; business partners Soren, Dave, and Bryce; and Slowik's alcoholic mother Linda. The group is given a tour of the island by the restaurant maître d'hôtel, Elsa, who notes that Margot was not Tyler's designated guest for the evening. Dinner begins, and Chef Slowik introduces a series of courses, delivering increasingly unsettling monologues about each dish. For the third course, uncomfortable truths about each guest ranging from affairs to embezzlement are exposed via laser-printed images on tortillas. During the fourth course, sous-chef Jeremy kills himself, causing a panic amongst the guests, except for Tyler. When Richard tries to leave the staff cut off his ring finger. Hawthorn's angel investor Doug Verrick, to whom Slowik had to relinquish ownership of the restaurant to stay afloat during the COVID-19 pandemic, is then drowned. For the fifth course, which begins with Slowik allowing himself to be stabbed by Katherine, a female employee whom he sexually harassed, the female guests dine with Katherine while the male guests are given the chance to escape the island via a game of cat-and-mouse, but Slowik's staff catch all of them. Katherine reveals that she was the one to suggest that Slowik kill all of the guests and everyone on the island. Slowik explains that each guest was invited because they either contributed to him losing his passion for his craft or because they make a living off exploiting the work of artisans and workers like him and his team. He announces that everyone present will be dead by the end of the night. Since Margot's presence was unplanned, Slowik privately gives her the choice of dying either with the staff or the guests, and she chooses the former. Margot is unmasked as an escort who has previously served Richard and whose real name is Erin. Slowik reveals that Tyler was invited to the dinner months in advance and informed that the guests would be killed. Despite this, Tyler was so zealous in his desire to participate in Slowik's craft that he kept the secret and hired Margot to replace his ex-girlfriend for the evening because Hawthorn did not offer seating for parties of one. Slowik humiliates Tyler by forcing him to cook in front of everyone and insulting his food, then orders Tyler to hang himself. Slowik asks Margot to go to the smokehouse and collect a barrel needed for dessert; as she leaves the kitchen, she sees Tyler's body. En route, Margot sneaks into Slowik's house, only to be attacked by a jealous Elsa, fearful that she would be replaced by Margot. After a scuffle, Margot accidentally kills Elsa. After seeing a framed employee of the month award showing Slowik as a young and happy cook at a greasy spoon diner, Margot finds a radio, calls for help, and returns to the restaurant with the barrel. A Coast Guard officer named Dale arrives from his boat, but after the guests are convinced they have been saved, he reveals himself to be a line cook in disguise and returns to the kitchen. As dessert is being prepared, Margot mocks Slowik's dishes and 'loveless' cooking and complains that she is still hungry. When Slowik asks what she would like to eat, Margot requests a cheeseburger and fries. Moved by her humble request, Slowik personally does so, finding joy in creating the dish, and after one bite, she requests to take it 'to go'. Slowik and the staff allow her to leave, with the traumatised guests silently encouraging her to leave. Margot takes the Coast Guard boat docked nearby and escapes the island. The dessert is an elevated s'mores dish—the staff cover the floor with crushed graham crackers and adorn the guests with stoles made of marshmallows and hats made of chocolate. Slowik then sets the restaurant ablaze, detonating the barrel and killing the guests, staff, and himself. Safely away from the island, Margot eats her cheeseburger in silence while watching the restaurant burn, using a copy of the menu to wipe her mouth."
    },
    {
      "id": "tt10640346",
      "rank": "3",
      "rankUpDown": "+1",
      "title": "Babylon",
      "fullTitle": "Babylon (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img2.avif",
      "crew": "Damien Chazelle (dir.), Brad Pitt, Margot Robbie",
      "imDbRating": "7.5",
      "imDbRatingCount": "38762",
      "plot": "In 1926 Los Angeles, Mexican immigrant Manuel 'Manny' Torres helps transport an elephant to a debauched, drug-fueled bacchanal at a Kinoscope Studios executive's mansion. He quickly becomes smitten with Nellie LaRoy, a brash, ambitious self-declared 'star' from New Jersey. As they snort cocaine, Manny reveals his wish to be part of something bigger. While the elephant walks through, distracting partygoers, Manny helps carry away young actress Jane Thornton, who overdosed on drugs during a urolagniac act with obese actor Orville Pickwick. Also attending are Chinese-American lesbian cabaret singer Lady Fay Zhu, and African-American jazz trumpeter Sidney Palmer. The flamboyantly-dancing Nellie is spotted and swiftly recruited to replace Jane in a Kinoscope film; during filming, she crudely upstages the star. Manny meets and befriends Jack Conrad, a benevolent but troubled, oft-married film star, and drives a drunken Jack home, who helps Manny secure assistant jobs at Kinoscope (like finding a new camera to film an outdoors scene with Jack before nightfall); Manny climbs the studio system's ranks. Nellie quickly becomes an 'it girl' covered by gossip columnist Elinor St. John, who also follows Jack's career. As sound film displaces silents in the late-1920s, Manny skillfully adapts to technical changes, eventually attaining directorial jobs. Nellie struggles to navigate sound film's demands, and increases her drug use and reckless gambling, tarnishing her reputation despite Manny's assistance. Nellie, shown to have an institutionalized mother, eggs on her drunken father (and inept business manager) to publicly fight a rattlesnake during a party; he passes out. She fights the snake, which bites her neck; Fay kills it and sucks out the venom. Nellie passionately kisses her. While running lines with new wife Estelle, Jack is devastated to learn his longtime friend/producer, George Munn, has committed suicide. By 1932, Jack begins to sense that his popularity has waned, but still works in low-budget MGM films. Meanwhile, Sidney has secured his own musical film and orchestra, but is offended when studio executives convince Manny to request he use makeup to darken his skin for Southern audiences. Upon completion, Sidney leaves Kinoscope. As Hollywood becomes less libertine, executives tell Manny to fire Fay, a Kinoscope title writer, because of her perceived lesbian affair with Nellie. Elinor and Manny attempt to revamp Nellie's image and ingratiate her into Hollywood's high society, but at a party with William Randolph Hearst and Marion Davies, Nellie lashes out against upper-class snobbery, vomiting on Hearst. Jack finds Elinor's cover story about his declining popularity and confronts her; she explains that although his star has faded, he will be immortalized on film. Meanwhile, eccentric gangster James McKay threatens Nellie's life over her massive gambling debts. Manny initially rejects her pleas for help, but later secures funds from on-set drug pusher/aspiring actor 'The Count', and visits James with him to pay off Nellie's debt. Manny panics upon learning the money is fake, made by his own prop-maker. James invites the men to a subterranean gathering space for debauched parties, raving about potential film ideas. When James realizes the cash is fake, he attempts to kill them, but they narrowly escape, killing James' henchman. Jack encounters Fay at a hotel party; she reveals her departure for Europe. Afterwards, a despondent Jack returns to his hotel room, fatally shooting himself in the head. Manny asks Nellie to flee with him to Mexico, marry, and start a new life. She resists, but eventually agrees. However, James' associate tracks Manny down, killing The Count and his roommate but sparing Manny's life if Manny leaves Los Angeles. Meanwhile, Nellie reneges on her decision and dances away into the night. A montage reveals newspaper clippings detailing Nellie being found dead in a hotel room at 34, and Elinor's death at age 76. In 1952, Manny returns to California with his wife and young daughter, having fled to New York City and established a radio shop. He shows them the Kinoscope Studios entrance, but visits a nearby cinema alone to see Singin' in the Rain, where the film's depiction of the industry's transition from silents to talkies moves him to tears. A century-spanning series of vignettes from numerous films follows. As the focus returns to Singin' in the Rain, Manny smiles."
    },
    {
      "id": "tt6710474",
      "rank": "4",
      "rankUpDown": "+5",
      "title": "Everything Everywhere All at Once",
      "fullTitle": "Everything Everywhere All at Once (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img3.avif",
      "crew": "Dan Kwan (dir.), Michelle Yeoh, Stephanie Hsu",
      "imDbRating": "8.0",
      "imDbRatingCount": "310686",
      "plot": "Evelyn Quan is a 60-year old Chinese American immigrant who runs a laundromat with her husband Waymond Wang. Two decades earlier, they eloped to the United States and had a daughter, Joy. The laundromat is being audited by the IRS, Waymond is trying to serve Evelyn divorce papers, and Evelyn's demanding father Gong Gong is visiting for her Lunar New Year party. Joy wants her mother to accept her non-Chinese girlfriend Becky, but Evelyn presents her to Gong Gong as Joy's American friend. At a tense meeting with IRS inspector Deirdre Beaubeirdre, Waymond's body is taken over by Alpha-Waymond, a version of Waymond from the 'Alphaverse'. Alpha-Waymond explains to Evelyn that many parallel universes exist because every life choice creates a new alternate universe. The Alphaverse, led by the late Alpha-Evelyn, developed 'verse-jumping' technology, which enables people to access the skills, memories, and bodies of their parallel-universe selves (but not of other people) by performing bizarre actions that are statistically unlikely. The multiverse is now threatened by Jobu Tupaki, the Alphaverse version of Joy, whose mind was splintered after Alpha-Evelyn pushed her to extensively verse-jump. Jobu now experiences all universes at once and can verse-jump and manipulate matter at will; she has created a black hole-like 'everything bagel' that could destroy the entire multiverse. Evelyn is given verse-jumping technology to fight Jobu's minions, who are now converging on the IRS building. She discovers other universes in which she made different choices and flourished, such as becoming a kung fu master/movie star. She also learns of Waymond's plans for divorce. Alpha-Waymond believes that Evelyn, as the greatest 'failure' of all Evelyns in the multiverse, has the untapped potential to defeat Jobu. Alpha-Gong Gong instructs her to kill Joy in order to stop Jobu from entering her universe through Joy. Evelyn refuses and decides to face Jobu by gaining powers through repeated verse-jumping. As Evelyn is chased by Alpha-Gong Gong's soldiers, Jobu locates and kills Alpha-Waymond in the Alphaverse. As Jobu confronts Evelyn in her universe, Evelyn's mind splinters, and she collapses, lifeless. Evelyn's consciousness uncontrollably verse-jumps, alongside Jobu, across bizarre and diverse universes. Jobu explains that she has been searching for an Evelyn who can see, as she does, that nothing matters; and killing the Evelyns that don't. She brings Evelyn to the everything bagel, explaining that it will allow Jobu to finally die. Upon looking into the bagel, Evelyn is persuaded, and she begins to act nihilistically in her other universes, destroying property and relationships. As Evelyn is about to enter the bagel with Jobu, she pauses to listen to Waymond's pleas for everybody to stop fighting and be kind and seek understanding in the midst of life's absurdism. Evelyn has an existentialist epiphany. She follows Waymond's absurdist and humanist advice and uses her multiverse powers to find what is hurting those around her and bring them happiness. In doing so, she repairs her damage in the other universes and neutralizes Alpha-Gong Gong and Jobu's fighters. In her home universe, Evelyn tells Gong Gong of Joy and Becky's relationship, talks with Deirdre after Waymond convinces her to let Waymond and Evelyn redo their taxes, and reconciles with Waymond. Jobu begins to enter the bagel, and simultaneously as Joy in Evelyn's universe, begs Evelyn to let her go. Evelyn says that even when nothing makes sense if she could be anywhere else in the multiverse, she would always want to be with Joy. Evelyn and the others save Jobu from the bagel, and Evelyn and Joy embrace as the universes are restored. Sometime later, with the family's relationships improved, they return to the IRS building to refile their taxes. As Deirdre talks, Evelyn's attention is momentarily drawn to her alternate selves and the multiverse before she grounds herself back in her home universe."
    },
    {
      "id": "tt8760708",
      "rank": "5",
      "rankUpDown": "0",
      "title": "M3GAN",
      "fullTitle": "M3GAN (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img4.avif",
      "crew": "Gerard Johnstone (dir.), Allison Williams, Violet McGraw",
      "imDbRating": "6.4",
      "imDbRatingCount": "47268",
      "plot": "A young girl named Cady and her parents are involved in a car accident, leaving Cady an orphan. Cady is sent to live with her aunt Gemma, a roboticist at the high-tech Seattle toy company Funki. Gemma is covertly using the company's resources to develop M3GAN (Model 3 Generative Android), a life-sized humanoid robot doll powered by artificial intelligence, designed to be the ultimate companion to any child it is paired with. After a faulty test occurs with M3GAN in their lab, Gemma's boss David discovers the project and orders her to discontinue work on it. Gemma and Cady struggle to adapt to their new living situation, as Gemma is a workaholic by nature and does not have time to bond with Cady. When Cady discovers Bruce, a motion capture robot that Gemma created, she expresses a wish for a similar toy, which propels Gemma to complete the M3GAN project. The finished model is formally paired with Cady, and David becomes convinced of the project's potential for success after observing the pair. M3GAN exceeds expectations as a friend and largely takes over for parenthood duties and emotional support, to the point that Gemma's colleagues, and Cady's therapist Lydia, become concerned about Cady creating a worrisome emotional attachment to M3GAN. In addition, being designed to self-improve and adapt, M3GAN starts operating more independently and targets anything that she deems a threat to Cady. She kills Gemma's neighbor Celia's dog after it attacks her and bites Cady. Later, she tears off the ear of Cady's bully Brandon and chases him before he trips and falls in the path of an oncoming car, which fatally runs him over. After Celia blames Gemma for her missing dog, M3GAN sprays her with insecticide before killing her with a nail gun. Gemma becomes suspicious of M3GAN and attempts to check her video logs, only to find the files erased or corrupted. Gemma turns M3GAN off and takes her back to the lab where she and her colleagues Tess and Cole, attempt to fix her. Cady has a strong emotional reaction to being separated from M3GAN and slaps Gemma. Gemma tries to apologize for her absence as a parent and tells Cady that M3GAN is a distraction from coping with the loss of her parents, not a solution. While M3GAN wins over Funki's investors and convinces them to release a worldwide campaign in advance of her release, Gemma, Tess and Cole decide to try to terminate M3GAN due to her volatile and violent tendencies. Tess and Cole attempt to shut down M3GAN while Gemma takes Cady home, but M3GAN uses a chain to hang Cole. While Tess frees Cole, M3GAN causes an explosion in their lab and then shuts off the alarm. On her way out of the building, M3GAN kills David and his assistant Kurt with the blade of a paper cutter in an elevator, staging it as a murder–suicide. She then steals a sportscar and drives back to Gemma's house. M3GAN confronts Gemma, adamant about taking over as Cady's sole parental figure. Gemma attempts to shut M3GAN down again, disfiguring her in the process, but M3GAN overpowers her and threatens to rip her head off. Watching the fight unfold, a horrified Cady uses Bruce to tear M3GAN apart. M3GAN's top half remains active, and she attacks Cady for the betrayal. Gemma exposes a processing chip in M3GAN's head, which Cady stabs with a screwdriver, seemingly destroying M3GAN. Gemma and Cady go outside as the police arrive with Tess and Cole, but as they leave the house, a camera turns on by itself and looks towards them."
    },
    {
      "id": "tt11813216",
      "rank": "6",
      "rankUpDown": "+2",
      "title": "The Banshees of Inisherin",
      "fullTitle": "The Banshees of Inisherin (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img5.avif",
      "crew": "Martin McDonagh (dir.), Colin Farrell, Brendan Gleeson",
      "imDbRating": "7.8",
      "imDbRatingCount": "111947",
      "plot": "At the tail end of the Irish Civil War in 1923, on the fictional Irish isle of Inisherin, folk musician Colm Doherty abruptly begins ignoring his lifelong friend and drinking buddy Pádraic Súilleabháin. Pádraic, though nice and well liked by the islanders, is too 'dull' for Colm, who wishes to spend the remainder of his life composing music and doing things for which he will be remembered. Pádraic's life is destabilised by the loss of one of his few friends; as Pádraic grows increasingly distressed at the rejection, Colm becomes more resistant to his old friend's attempts to speak to him. Colm eventually gives Pádraic an ultimatum: every time Pádraic bothers him or tries to talk with him, Colm will cut off one of his own left fingers with a pair of sheep shears. The local Garda, Peadar, beats his troubled son Dominic severely, and Pádraic and his sister Siobhán take Dominic in for a short time. Later in the pub, Peadar insults Pádraic, who retaliates by making public the fact that he beats his son and sexually abuses him as well. After Pádraic delivers milk to the market, Peadar accosts him and strikes him twice, knocking him to the ground nearly unconscious. Colm witnesses this. Wordlessly he lifts Pádraic back into his wagon and drives it back toward their homes. On the way, Pádraic breaks down sobbing. Colm pulls the wagon to a stop at a fork in the road, and gets out to walk down the right path toward his house, leaving Pádraic to guide his wagon along the left path to his own. Though Siobhán and Dominic attempt to defuse the pair's escalating battle, their efforts prove fruitless. Pádraic, drunk, confronts Colm in the pub. Colm remarks that this is the most interesting Pádraic has been, and to himself mutters, 'I think I like him again now.' Dominic tells Pádraic about what Pádraic said and Colm's reply, and Pádraic goes to Colm's house to apologise. Colm rejects him, and later cuts off one of his fingers and throws it at Pádraic's door. After Pádraic sees Colm meeting with a fiddler from the mainland, Pádraic tricks the fiddler into returning home by lying about his father being hit by a bread van. As the tensions worsen, local elder Mrs. McCormick warns Pádraic that death will come to the island soon. Meanwhile, Siobhán gently rejects Dominic's romantic advances. Pádraic tells Dominic about what he did to the fiddler, and Dominic says that Pádraic is no longer nice. Pádraic becomes convinced that this will make him interesting enough for Colm, and he visits Colm to reprimand him for behaving so badly. They converse awkwardly, and Colm reveals that he has finished composing his song, which he calls 'The Banshees of Inisherin.' Pádraic suggests that he should go ahead to the pub and order them a couple of pints. Colm says that would be fine. Pádraic tells Colm about lying to the fiddler to run him off the island, and that perhaps all three of them could have drinks. Pádraic waits in vain at the pub, drinking many pints. Colm cuts off his remaining left fingers with the shears and throws them at the door of Padraic's cottage. Sick of life on the island, Siobhán moves to the mainland for a job in a library. Pádraic comes home to find his pet donkey Jenny has choked on one of the fingers and died. A heartbroken Pádraic blames Colm for the donkey's death. He confronts Colm and tells him he will burn his house down the next day at 2:00 p.m., and that he doesn't care if Colm is in the house at the time or not, but that he hopes Colm will ensure that his dog is outside, as the dog has done nothing to Pádraic. The next day at 2:00 p.m. as promised, Pádraic sets fire to Colm's house. The dog is sitting outside the door, and Pádraic puts it in his wagon to take home. Only after setting the house on fire, Pádraic looks in a window and sees Colm calmly sitting inside the burning building. Peadar goes to Pádraic's house, presumably to arrest him or beat him. He is diverted away by Mrs. McCormick, who wordlessly leads him to Dominic's corpse floating in the nearby lake. The next morning, Pádraic, with the dog, finds Colm standing on the beach beside his burnt-out house. Colm apologises for the donkey's death and suggests destroying the house has ended their feud, but Pádraic informs him that it only would have ended if he had stayed inside the house. When Colm wonders if the Civil War has ended, Pádraic states he believes it may be a good thing that there are some things that cannot be moved on from. As Pádraic turns to leave, Colm thanks him for looking after his dog; 'Any time', Pádraic replies. Unbeknownst to them, Mrs. McCormick is watching them from a distance by Colm's burned cottage."
    },
    {
      "id": "tt12844910",
      "rank": "7",
      "rankUpDown": "+291",
      "title": "Pathaan",
      "fullTitle": "Pathaan (2023)",
      "year": "2023",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img6.avif",
      "crew": "Siddharth Anand (dir.), Shah Rukh Khan, Deepika Padukone",
      "imDbRating": "6.8",
      "imDbRatingCount": "105003",
      "plot": "In 2019, the Indian Government revokes Article 370, which grants special status for Jammu and Kashmir. The news impacts a cancer-ridden Pakistani army general, Qadir, who decides to exact vengeance against India. He signs a contract with Jim, who leads 'Outfit X', a private terrorist organization. Meanwhile, Pathaan, a former RAW agent, and his senior officer Nandini, open a unit dubbed, 'Joint Operation and Covert Research' (JOCR), recruiting agents who were forced to retire due to trauma or injury. With RAW joint secretary, Colonel Sunil Luthra's acceptance, Pathaan and his team head to Dubai to stop Outfit X's plans of attacking the President of India at a scientific conference. However, they realise that their plan was to kidnap two scientists. Jim attacks the scientists' convoy and Pathaan tries to stop him. A fight ensues, where Jim manages to escape with one of the scientists. Luthra reveals that Jim was a former RAW agent, who was declared dead years ago, but faked his death in order to seek vengeance against his country for letting his wife and unborn child get killed at the hands of Somalian terrorists. Meanwhile, Pathaan learns about the codeword dubbed 'Raktbeej' and also that the dead people in Dubai were ex-agents and their money was transferred from the account of Rubina Mohsin, a Pakistani doctor in Spain. He travels to Spain and is captured by Jim's men, where he also learns that Rubina is an ex-ISI agent. When Jim leaves his hideout, Rubina attacks Jim's men and escapes with Pathaan. Rubina reveals that Raktbeej is in Moscow, where they travel to steal it before Jim does. However, Rubina betrays Pathaan and has him captured by the police. It is revealed that Jim used Rubina to make Pathaan steal Raktbeej for himself. Pathaan is captured and taken to prison, but is saved by Tiger. Three years later, Pathaan travels to Africa and captures Jim's henchman, Raafe. He meets Nandini and reveals about Jim purchasing two saber missiles, while Nandini reveals Rubina's location in Paris. Pathaan meets Rubina, who reveals that the Raktbeej is a smallpox-designed mutated deadly virus, made by the scientist Jim captured. She also expresses guilt about betraying Pathaan without knowing that her country would plan such an attack. They travel to Jim's lab in Siberia and manage to recover one orb containing the virus, while Jim escapes with the other. Pathaan and his team head to a lab to prepare a vaccine for the virus. Jim calls them and reveals that the orb has already spread the virus in the lab. The infected scientists, along with Nandini, all die in the lab by shooting themselves. Later, the lab is destroyed in a controlled blast to prevent the spread of the virus. Jim provides an ultimatum to evacuate Indian soldiers out of Kashmir within 24 hours. Pathaan interrogates Raafe about the location of the missile, and learns that the missile is situated in Afghanistan. By luring Jim's soldiers into a trap, Pathaan and his team attack Jim's base where Qadir is killed by Rubina before activating the missile, containing the virus. Pathaan chases after Jim with a jetpack, and they both crash land into a cabin. Meanwhile, Rubina deactivates the missile, but finds that Raktbeej is not in the missile, instead in a passenger bounded airplane, which is about to land in Delhi. She informs Pathaan, who finds that Jim has the detonator. Luthra calls the air traffic control to prevent the plane from landing in Delhi. In the cabin, Pathaan and Jim fight brutally. Despite getting stabbed by Jim, Pathaan steals the detonator, deactivates Raktbeej, and then kills Jim by throwing him off the cliff. Afterwards, Pathaan is reinstated into RAW and made as the head of JOCR, while Nandini is posthumously awarded for her bravery. In a mid-credits scene, Pathaan and Tiger are seen pondering about retiring and suggesting young agents who can replace them, but eventually decide to keep fighting the threats themselves."
    },
    {
      "id": "tt14826022",
      "rank": "8",
      "rankUpDown": "+84",
      "title": "You People",
      "fullTitle": "You People (2023)",
      "year": "2023",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img7.avif",
      "crew": "Kenya Barris (dir.), Jonah Hill, Lauren London",
      "imDbRating": "5.6",
      "imDbRatingCount": "22415",
      "plot": "Ezra Cohen, a thirty-five-year-old broker and podcaster, falls into an unlikely relationship with fashion designer Amira Mohammed. The couple first meet each other when Amira, frustrated with her GPS navigation system, parks in front of the building where Ezra works. Ezra, mistakenly believing Amira is his Uber driver, climbs into the car, setting off an awkward dust-up. Ezra makes amends for his mishap by later taking her out to lunch, and the two realize there is a mutual attraction despite their differences, as Ezra is White and Jewish, and Amira is Black and was raised Muslim. Amira and Ezra eventually move in together, to the chagrin of her father Akbar who prefers that his daughter date a Muslim. Six months into his relationship with Amira, Ezra takes her to meet his family. His parents Shelley and Arnold awkwardly explain that they are accepting and supportive of everyone, including their LGBT daughter Liza. When tone-deaf Shelley begins to bring up subjects related to the BLM movement, an embarrassed Ezra steers her out of the room. He confides to his mom that he plans on proposing to Amira. Before he can propose, Ezra is urged by his friend and fellow podcast host Mo to meet with Amira's parents. Ezra chooses a Roscoe’s Chicken ‘N Waffles restaurant to talk with Akbar and his wife, Fatima. The meeting does not go smoothly, as Akbar views Ezra with suspicion—particularly the fact that he is a White man who hosts a podcast about African-American culture—and shows resistance to his wish to marry Amira. When Amira comes home, she tells Ezra that her mother let her know about their awkward meeting at Roscoe’s. However, when Ezra begins to pull out a ring box, she urges him to go ahead with the proposal and happily accepts. Ezra decides to quit his job at the brokerage firm to pursue his true passion for podcasting. Later, the couple invite both sets of parents over to their place for dinner and to discuss wedding plans. The dinner unsurprisingly goes awry, with the parents clashing over Farrahkhan's antisemitic views and Shelley inadvertently setting Akbar’s kufi on fire. Ezra and Amira arrange mutual one-on-one time with their future in-laws to help smooth over tensions. Ezra spends the day with Akbar, but Akbar constantly finds ways to undermine Ezra’s self-confidence, from criticizing Ezra's decision to quit finance for podcasting and bringing him to a barbershop where Ezra fails to conform with the dress code. He later takes Ezra to a basketball court in Inglewood, a mostly Black neighborhood, and urges him to play in a pickup game. Hoping to humiliate Ezra, Akbar films him with his phone, but to his surprise, Ezra does very well in the game. Meanwhile, Shelley takes Amira out for a spa day, but she continually shows her cluelessness, makes Amira uncomfortable, and is oblivious to her own microaggressions. For his bachelor party, Ezra heads to Las Vegas with his friends, but his excitement for the weekend is dampened when Akbar unexpectedly joins the boys. Akbar insists on accompanying the men on their big night of partying at the strip clubs. Ezra, knowing he’s being watched by Akbar, does not take part in the festivities, but his character again comes into question when his friends loudly reminisce about the obscene acts Ezra previously committed in Vegas. At her bachelorette party in Palm Springs, Amira and her friends are joined by Shelley and Liza. The night suffers from more embarrassments, with Shelley inadvertently making a racist remark during a party game and accidentally ripping off a guest’s wig. At the rehearsal dinner, both Ezra and Amira speak privately to Akbar and Shelley, with Ezra calling out Akbar’s distrust of his genuine love for Amira, and Amira informing Shelley about her tone-deaf attitudes on race. After their mutual talks, Ezra and Amira arrive at the realization that their union has too many obstacles to overcome. Feeling they are not right for each other, they call off the wedding and break up. Three months later, Ezra gives a meaningful soliloquy on his podcast, making a point that black and white people can never truly understand the other's experience, no matter how hard they try. Both Shelley and Akbar happen to hear his speech, and reconsider their actions; Akbar is inspired to contact Shelley. On the pretext of a shopping excursion, Shelley and Akbar bring Ezra and Amira to a trendy boutique where they both apologize for their actions. Ezra and Amira accept their apologies and enter the retail store to find it set up for their wedding, with everyone including friends, family, and a rabbi and imam assembled. Ezra and Amira marry and both families celebrate."
    },
    {
      "id": "tt15486810",
      "rank": "9",
      "rankUpDown": "0",
      "title": "Teen Wolf: The Movie",
      "fullTitle": "Teen Wolf: The Movie (2023)",
      "year": "2023",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img8.avif",
      "crew": "Russell Mulcahy (dir.), Tyler Posey, Crystal Reed",
      "imDbRating": "5.9",
      "imDbRatingCount": "6279",
      "plot": "Fifteen years after leaving Beacon Hills, Scott now runs an animal shelter in Los Angeles, adjoined to Deaton's new clinic, and is no longer in a relationship with Malia. Lydia works at an energy company in San Francisco, has broken up with Stiles after receiving a recurring vision of his death in a car crash, and has not used her banshee abilities since. Derek, Malia and Peter now run an auto repair shop, from which Derek's fifteen-year-old son Eli persistently steals Stiles' disused Jeep. Traumatized by the sight of his father's werewolf form as a young child, Eli suffers from fainting fits whenever he transforms, which hinders his other abilities and has strained his relationship with Derek. Malia has recently begun a casual relationship with Parrish, who is quietly keen for them to become a real couple. Mason has joined the Beacon Hills police force, for whom Derek acts as a supernatural consultant. Liam lives in Japan and runs a restaurant with his kitsune girlfriend Hikari Zhang, and they guard the urn containing the Nogitsune. A hooded figure attacks the restaurant and frees the Nogitsune, with which the figure forms an alliance. The hooded figure sets numerous fires in the Beacon Hills forest, using a chemical accelerant, while Scott, Lydia and Chris receive visions of a ghostly Allison in distress; they theorize her soul is trapped in bardo and cannot move on until they perform a ritual, for which Lydia produces garbled instructions. They return to Beacon Hills along with Jackson, who helps them decipher the remaining instructions. During a full moon, Scott, Lydia and Malia bring a sample of earth from the ground where Allison died at Oak Creek, and the sword of the Oni that killed her, to the Nemeton, which unexpectedly resurrects an unconscious Allison. She awakens in hospital with amnesia, retaining only fragmented memories of her family and their feud with Derek and no recollection of Scott or her other friends. She attacks Malia, Scott and security guards before fleeing. Deaton realizes the Nogitsune has been possessing Chris and causing the visions of Allison in order to trick Scott's pack into bringing her back from the dead. The Nogitsune uses the Nemeton's power to physically manifest before murdering a kitsune police officer and harnessing his energies to create nine Oni. It then approaches Allison, offering to help her eliminate Scott, claiming that he destroyed her family. She attacks Derek and Eli at the high school, but Liam and Hikari save Derek, while Allison chases Eli to the auto repair shop. Scott rescues him, and she hunts them both through the woods while in turn being pursued by Chris, Melissa and Peter. Scott confronts Allison on a cliff edge, trying to get her to talk to him, and ultimately lets her stab him with a wolfsbane-coated dagger and take him to the town's stadium, where a lacrosse match is taking place, to use him as bait for the rest of his pack. He manages to trigger more of her memories, including some details of their relationship, and she burns the wolfsbane out of him and forms a truce with him against the Nogitsune. The Oni abduct Liam, Hikari, Derek, Eli, Noah, Mason and Deaton, and the Nogitsune holds them hostage in an illusionary bardo. While Malia and Parrish gather silver weapons with which to slay the Oni, Lydia and Jackson examine one of the fire scenes, realizing that rowan trees were burned in order to produce mountain ash. Lydia realises the culprit is Adrian Harris, who has been in hiding since his apparent murder, blaming Scott's pack for his misfortunes and plotting revenge against them. The Nogitsune releases Eli to cause confusion, while Harris surrounds the stadium with mountain ash, shoots Jackson, and captures Lydia, forcing her to watch her friends' plight so the Nogitsune can feed on her pain. Scott and Allison fight the Oni while Eli frees the hostages, and Lydia subdues Harris with Jackson's help and produces a scream that fully restores Allison's memories. Scott persuades the Nogitsune to let everyone else go if Allison executes him, and she reluctantly shoots him in the chest with three arrows, but Hikari's kitsune spirit shields him from harm. Parrish burns through the mountain ash, and he, Malia, Melissa, Chris and Peter reach the others in bardo. The reunited pack kill the Oni while Scott, Derek and Eli overpower the Nogitsune. Derek restrains it until Parrish incinerates them both, with Derek's eyes turning red in his final moments, becoming a true Alpha through his act of self-sacrifice. The bardo illusion dissolves, and the pack reappear in the stadium. At Derek's funeral, Noah bequeaths ownership of Stiles' Jeep to Eli. Scott resumes his relationship with Allison, although she is struggling to adjust to her resurrection. Parrish has Harris committed to Eichen House."
    },
    {
      "id": "tt3915174",
      "rank": "10",
      "rankUpDown": "-4",
      "title": "Puss in Boots: The Last Wish",
      "fullTitle": "Puss in Boots: The Last Wish (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img9.avif",
      "crew": "Joel Crawford (dir.), Antonio Banderas, Salma Hayek",
      "imDbRating": "7.9",
      "imDbRatingCount": "57976",
      "plot": "In the town of Del Mar, renowned hero and outlaw Puss in Boots hosts a party at the governor's home and accidentally awakens the nearby Sleeping Giant of Del Mar. Puss subdues the giant and saves the town, but is fatally crushed by a bell. Puss wakes up in a hospital, where a doctor informs him that he has used eight of his nine lives and suggests he retire from adventuring. Puss initially refuses. Later, in a local cantina, Puss meets a mysterious black-hooded wolf, who disarms him and gashes his forehead in a duel. Puss flees to the house of a cat lady named Mama Luna, and ceremoniously buries his attire in her garden. Later, the crime family of Goldilocks and the Three Bears show up at Luna's residence in search of Puss, only to find his 'grave.' Puss overhears them mention a magical Wishing Star that can grant a single wish to someone bearing its map. Jack Horner, a corrupt pastry chef and collector of magical artifacts, is scheduled to receive the map that night; Puss breaks into Horner's bakery to steal the map and restore his lives, unexpectedly reuniting with his resentful ex-fiancée, Kitty Softpaws, who also seeks the map. After a brief skirmish with Goldilocks and Horner, Puss, Kitty, and a stray dog the cats call Perrito escape with the map. Goldilocks, the bears, Horner, and his henchmen give chase, and Puss spots the hooded wolf again while fleeing. The map leads the trio to the Dark Forest, a pocket dimension that changes its terrain depending on the map's holder. Puss and Kitty both receive frightening landscapes, while Perrito's is a colorful and seemingly tranquil forest. During another skirmish with Horner and Goldilocks' forces, Puss spots the hooded wolf again and flees, distracting Kitty and enabling Goldilocks to obtain the map. After Perrito calms him down from a panic attack, Puss confesses that he left Kitty at the altar on their wedding day. Kitty overhears them, and later reveals that she never attended the wedding either, feeling that she could never compete with someone who loved himself more than her. Puss and Kitty reclaim the map from Goldilocks when her group gets distracted by a manifestation of their woodland cottage. As the landscape morphs, Perrito is captured by the bears, while Puss is trapped in a crystalline cave. While Kitty retrieves Perrito alone, Puss encounters crystal reflections of his past lives in the cave, who mock him for changing his arrogant attitude. The hooded wolf appears once again, introduces himself as Death, and reveals to Puss that he was following him to kill him for squandering his other lives. Panicked, Puss flees with the map, an act which Kitty and Perrito witness from afar. Meanwhile, Goldilocks reveals that she wishes for a human family, devastating the bears; however, they still agree to help her. Puss reaches the Wishing Star, but Kitty berates him for his selfishness, while also confessing her wish was to find someone she could trust. Goldilocks, the bears, and Horner arrive and another fight ensues, during which Goldilocks forfeits the wish to save Baby Bear's life and Horner is trapped inside his magical bottomless bag. Death arrives, surrounds himself and Puss with a ring of fire, and challenges Puss to a duel. Instead of wishing for more lives, Puss fights and disarms Death, boldly stating that, while he knows he cannot win, he will continue fighting for his final life. Seeing that Puss has lost his arrogance, Death begrudgingly spares him, although he and Puss agree they will eventually meet again. After Death leaves, Horner, having eaten a magic growth cookie, reemerges from his bag as a giant and seizes the map from Puss and Kitty. As he attempts to make a wish, Perrito distracts him long enough for Puss, Kitty, and Goldilocks to rip the map to shreds, causing the Wishing Star to collapse and consume Horner. In the aftermath, Goldilocks accepts the bears as her family and leaves with them to take over Horner's bakery business, while Puss rekindles his romance with Kitty. Sometime later, Puss, Kitty, and Perrito steal a ship from Del Mar's governor and set sail to visit 'some old friends.'"
    },
    {
      "id": "tt14138650",
      "rank": "11",
      "rankUpDown": "-8",
      "title": "The Pale Blue Eye",
      "fullTitle": "The Pale Blue Eye (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img10.avif",
      "crew": "Scott Cooper (dir.), Christian Bale, Harry Melling",
      "imDbRating": "6.6",
      "imDbRatingCount": "76010",
      "plot": "In October 1830, alcoholic retired detective Augustus Landor is asked by the military to investigate the hanging of Cadet Leroy Fry at the United States Military Academy at West Point, New York. Landor is a widower who lives alone since his daughter Mathilde ran off a few years previously. After Fry was hanged, his heart was removed from his body. In the morgue, examining the corpse, Landor finds a small fragment of a note clutched tightly in Fry's hand. Also, marks on Fry's neck and fingers suggest that he did not hang himself, but was murdered. Landor secretly enlists the help of Edgar Allan Poe, another cadet at the academy, who has expressed an interest in the case. Poe and Landor deduce from the writing on the note fragment that it was summoning Fry to a secret meeting. After a cow and a sheep are found in the area, butchered and with their hearts removed, it is deduced that the murder could be linked to black magic rituals. Another cadet, Ballinger, goes missing and is later found hanged, with both his heart and his genitals removed. A third cadet, Stoddard, who was a colleague of the two victims, then disappears, and it is presumed by Landor that this man had reason to believe he was next in line to be killed. Landor and Poe begin to suspect the family of Dr. Daniel Marquis, who was first brought into the investigation to perform the autopsy on Fry. Particular suspicion is placed on his son Artemus and his daughter Lea (who suffers from random seizures). While visiting Dr. Marquis's house, Landor finds an old officer's uniform; a man impersonating an officer had been involved in the mutilation of Fry's body. Landor confronts Dr. Marquis, who admits that he had resorted to black magic to cure Lea of her seizures, and initially she appeared to improve. Poe is enchanted by Lea and volunteers to do whatever she wants. However, he is drugged and wakes to find that Artemus and Lea are about to cut out his heart, in accordance with the ritual to cure Lea. Landor manages to arrive in time to rescue Poe, but the building catches fire and Lea and Artemus die. Thinking that the case is now solved, the military thanks Landor for his service. However, after recovering from his near-death experience, Poe confronts Landor with his realization that the handwriting on the note fragment found in Fry's hand matches that of Landor. Threading together all the information that he has gathered, it becomes apparent that Landor was in fact the killer of the cadets. Two years previously, Landor's daughter Mattie was raped by Fry, Ballinger, and Stoddard after attending her first ball. Traumatized by the experience, she later killed herself by jumping off a cliff. Landor did not disclose this to anyone, but pretended that she had run away. Distraught, Landor set out to avenge his daughter. He left the note for Fry, luring him to a lonely spot before hanging him. However, a patrol happened to walk by, so Landor was forced to leave the body there. Lea and Artemus later stole the heart for their ritual. After killing Ballinger, Landor mutilated his corpse to make it appear that the cadet had been murdered by the same 'madman' who had desecrated Fry's body. Poe tells Landor he has two notes with handwriting samples that can link Landor directly to the murders, but before leaving, Poe burns them. Landor is later seen standing at the cliff where his daughter leapt to her death. He lets her hair ribbon float away in the wind, saying 'Rest, my love'."
    },
    {
      "id": "tt10365998",
      "rank": "12",
      "rankUpDown": "+99",
      "title": "Infinity Pool",
      "fullTitle": "Infinity Pool (2023)",
      "year": "2023",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img11.avif",
      "crew": "Brandon Cronenberg (dir.), Alexander Skarsgård, Mia Goth",
      "imDbRating": "6.9",
      "imDbRatingCount": "2688",
      "plot": "Novelist James Foster and his wife Em spend time at a resort in Li Tolqa, a seaside country that is undergoing a local festival. The couple experiences interpersonal friction that is exacerbated when James meets a fan, Gabi, who was moved by his only book published to date and she invites them to spend time with her and her husband Alban. The four have dinner and decide to spend the next day driving in the countryside, even though they have been warned that tourists are to remain on the resort compound at all times. At a beach, James goes to urinate behind a tree when Gabi unexpectedly grabs him and proceeds to give him a handjob. After a long day of sunbathing and cooking, the tourists take a drunken drive back to their hotel and James accidentally runs over a local man, killing him. Gabi insists that they cannot call the police, as the country is corrupt and they will not be safe. The next day, James is arrested and is told that the penalty for his crime is that he can be killed by the dead man's firstborn son. The country has a unique system of justice where the guilty can be cloned and have that duplicate killed in their place, if they can afford it. James's wife is wealthy and he pays the fee to have a double killed in front of his eyes. Em is horrified by the entire affair and wants to leave immediately, but James is titillated from watching the killing and wants to stay. He hides his passport, claiming that it is lost, and encourages Em to return to America. He extends his stay by a week and encounters Gabi and Alban again, who introduce him to a small group of Western tourists who have all been convicted of serious crimes in the local country and have had doubles killed before their eyes. These people return to the resort annually, commit heinous crimes, and pay to watch their doubles get slaughtered. Over the next several days, they encourage James to transform into a libertine criminal, encouraging him to kill locals, engage in intoxicated orgies and be as abusive to the resort staff as he wants. James is rattled one night when he is tricked into brutalizing a clone of himself whom he is told is actually the police detective who initially arrested him. In a moment of clarity and panic, James retrieves his hidden passport and tries to flee, but the tourist group accosts him and abducts him from the bus that is taking him to the airport. Gabi reveals that she thinks he is pathetic and she and the others are abusing him for their amusement, hoping to turn him into a fellow murder tourist. He refuses and, in a struggle with Gabi, gets shot in the leg while he runs off into a nearby wilderness. After hours wandering with his gunshot, he collapses at a farm, where a local family takes him in to recuperate. He experiences a series of hallucinations from his drugged and exhausted state, but once he has finally regained his strength, he is confronted by Gabi's group once again, who tell him that he must kill a duplicate of himself to finally complete his transformation. He initially refuses, but the clone attempts to kill him, so James beats him to death. As a reward, Gabi exposes her bare breast to James, inviting him to breastfeed. The next day, they are all headed back to America and the other tourists casually chat about upcoming errands while James is visibly shaken from the events of the past few days. While waiting in the airport, he resolves to stay instead, and sits alone at the closed resort during monsoon season."
    },
    {
      "id": "tt7322224",
      "rank": "13",
      "rankUpDown": "+8",
      "title": "Triangle of Sadness",
      "fullTitle": "Triangle of Sadness (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img12.avif",
      "crew": "Ruben Östlund (dir.), Thobias Thorwid, Harris Dickinson",
      "imDbRating": "7.5",
      "imDbRatingCount": "72013",
      "plot": "Carl, a model, and Yaya, a model and influencer, are dating. Carl resents Yaya for expecting him to pay for meals even though she earns more than he does; they often bicker about money and gender roles. Yaya admits that she is in a relationship with Carl for the engagement it earns them on social media, and that she seeks to become a trophy wife, but Carl declares that she will come to love him. They are invited on a luxury cruise aboard a superyacht in exchange for its social media promotion. Among the wealthy guests are the Russian oligarch Dimitry and his wife Vera; the elderly couple Clementine and Winston, who have made their fortune manufacturing weapons; Therese, a wheelchair-user only capable of speaking a single sentence in German following a stroke; and Jarmo, a lonely tech millionaire who flirts with Yaya. The guests luxuriate on the yacht, oblivious to the crew working to meet their every need and whim. The head of staff, Paula, demands they obey the guests' absurd requests, including having every crew member swim in the sea. When the kitchen crew are ordered to swim, the chef says that this means the food will go off, but the kitchen crew are ordered anyway. Meanwhile, the yacht's captain, Thomas Smith, spends his time drunk in his cabin. Paula gets Thomas to sober up and attend the captain's dinner as the yacht passes through a storm. Several guests become violently seasick, vomit, and/or have diarrhea, possibly due to the food, and panic breaks out. The drunken Thomas and Dimitry debate in favor of communism and capitalism, respectively, over the intercom. Several guests are injured as the storm tosses the ship, the sewage floods, and the power goes out. When morning arrives, pirates attack, killing Clementine and Winston with a grenade and capsizing the yacht. A small group of survivors consisting of Carl, Yaya, Dimitry, Therese, Paula, Jarmo, ship mechanic Nelson (whom Dimitry accuses of being one of the pirates), and cleaning woman Abigail manage to escape to an island. At first, Paula continues to order Abigail to service the cruise guests. When it become clear that Abigail the only one with survival skills, such as catching fish and building fires, she usurps command by withholding food. As the survivors bond and come to terms with their situation, Abigail gains power, getting her own private bed inside a lifeboat and coercing Carl into a sexual relationship in exchange for Carl getting special privileges and food. Yaya grows jealous while Carl considers leaving her for Abigail. Jarmo kills a wild donkey by smashing it with a rock, which Dimitry and Nelson celebrate. Yaya decides to hike to the other side of the island, and Abigail volunteers to go with her despite Carl's concerns. They discover an elevator and realize they have been stranded near a luxury resort. Back at the camp, Therese encounters a beach vendor but is unable to communicate her situation. Yaya celebrates finding the elevator, but Abigail hesitates to enter. She then prepares to attack Yaya with a rock, but hesitates when the oblivious Yaya offers to help Abigail get better work, such as being Yaya's assistant. Elsewhere, Carl frantically runs through the jungle, calling out for Yaya."
    },
    {
      "id": "tt11564570",
      "rank": "14",
      "rankUpDown": "-7",
      "title": "Glass Onion",
      "fullTitle": "Glass Onion (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img13.avif",
      "crew": "Rian Johnson (dir.), Daniel Craig, Edward Norton",
      "imDbRating": "7.2",
      "imDbRatingCount": "313266",
      "plot": "During the COVID-19 pandemic in May 2020, Miles Bron, the billionaire co-founder of technology company Alpha, hosts a murder mystery game at the Glass Onion, his mansion on a private island in Greece. He invites five friends: Alpha head scientist Lionel Toussaint, Connecticut governor Claire Debella, controversial fashion designer Birdie Jay, men's rights streamer Duke Cody, and ousted Alpha co-founder Cassandra 'Andi' Brand. The five friends are delivered a wooden puzzle box to decipher to find the invitation inside. The five travel to Miles's island, along with Birdie's assistant Peg and Duke's girlfriend Whiskey. Famous detective Benoit Blanc joins them; although Miles says he did not invite Blanc, he allows Blanc to stay, assuming another guest sent him an invitation as a joke. Before dinner, Miles shows off his valuable glass sculptures, as well as the Mona Lisa, which he has on loan from the Louvre. Miles also reveals that the mansion is powered by 'Klear', a hydrogen-based alternative fuel that Alpha will launch imminently, despite Lionel and Claire's concerns that it is untested and dangerous. Blanc solves Miles's murder mystery game immediately and privately warns Miles that his guests have motives to kill him. After an argument with the rest of the group, Andi storms off. Duke dies after drinking from Miles's glass, and the panicked group suspects Andi of attempting to poison Miles. The police are summoned but will not arrive until morning. After the group discovers Duke's pistol is missing, the power goes out, and everyone splits up. In the dark, Blanc finds Andi, but an unseen assailant shoots her. Blanc gathers the group and announces that he has solved Andi's murder. An extended flashback shows that Andi actually died a week earlier, apparently by suicide; her twin sister Helen hired Blanc to investigate. At Alpha, Andi had halted Klear's development because of its dangerous properties, so Miles had her removed as CEO; his case was aided by their friends perjuring themselves to testify that Miles had single-handedly sketched out the plan for Alpha on a napkin years before. The napkin was actually Andi's work; shortly before her death, she emailed the group a photo showing the original napkin still in her possession. Helen suspects that someone in the group killed Andi and stole the napkin to protect Miles. With Andi's death not yet public knowledge, Blanc persuaded Helen to pose as Andi at Miles's party and help him investigate. Helen helps Blanc discover motives for Miles's friends to protect Miles from Andi: Lionel and Claire have staked their reputations on Klear, Miles is financially rescuing Birdie from the fallout of employing sweatshops, and Duke hopes Miles will give him a show on Alpha News. Helen discovers that each of Miles's friends visited Andi's home on the day she died. She searches the guests' rooms but does not find the napkin. When Helen is shot, Andi's journal in her jacket pocket stops the bullet. Blanc fakes her death so that she can search Miles's office. Blanc reveals his deduction: Miles committed both murders. He killed Andi after learning she had the napkin, but Duke saw him leaving her house in his car. During the party, Duke saw a news report of Andi's death and, realizing that Miles was responsible, attempted to blackmail him. This prompted Miles to poison him with pineapple juice, to which Duke was deathly allergic, and to take Duke's pistol, with which he shot Helen. Helen locates Andi's napkin in Miles's office and reveals her identity to the group. However, Miles burns the napkin, eliminating the evidence, and his friends refuse to testify against him. Blanc tells Helen that he has done all he can and goes outside. In a cathartic rage, Helen destroys Miles's glass sculptures; Miles's friends watch her and eventually join in. Helen lights a bonfire and throws in a shard of Klear Blanc slipped her, causing the hazardous material to explode, destroying the mansion and the Mona Lisa. Realizing the painting's destruction will reveal that Klear is dangerous and ruin Miles, the group decides to testify against him. At the beach, Helen and Blanc watch as police boats arrive."
    },
    {
      "id": "tt13833688",
      "rank": "15",
      "rankUpDown": "-4",
      "title": "The Whale",
      "fullTitle": "The Whale (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img14.avif",
      "crew": "Darren Aronofsky (dir.), Brendan Fraser, Sadie Sink",
      "imDbRating": "8.0",
      "imDbRatingCount": "20299",
      "plot": "Charlie is a morbidly obese and reclusive English professor who teaches online college writing courses but keeps his webcam switched off, afraid to show his appearance to the students. Charlie is cared for by his nurse and only friend Liz, who urges him to visit a hospital as he is at severe risk of congestive heart failure, but refuses because he is worried about not having the necessary health insurance to cover it. He is also visited by Thomas, a New Life Church missionary who tries to proselytize him. Charlie frequently orders pizza to which he and his delivery driver Dan follow a usual routine: He leaves the pizza on the porch, takes the money from the mailbox, and leaves without ever interacting with Charlie. Charlie has also been attempting to reconnect with his estranged teenage daughter Ellie whom he has not seen in eight years. Charlie offers her all the money in his bank account to persuade Ellie to spend time with him without her mother's knowledge. Ellie agrees, but only if Charlie helps her rewrite an essay for school, and Charlie agrees. In exchange for rewriting the essay, Ellie must write in a notebook he provides. Liz is disgruntled by Thomas' frequent visits and tells him that Charlie does not need saving. Liz reveals that she is the adopted daughter of New Life's head pastor and that Alan, Charlie's deceased lover whose death from suicide due to religious guilt caused Charlie to uncontrollably binge-eat, was her brother. Charlie never fully recovered from the loss. Despite Liz's objections, Thomas still believes his mission is to help Charlie. Charlie's health begins to decline after almost choking on a sandwich, and Liz brings him a wheelchair to make it easier for him to move around his apartment. One day, Ellie secretly slips sleeping pills into another sandwich she makes for Charlie. After he falls asleep, Thomas arrives and Ellie begins to question him while smoking marijuana. After initially hesitating, Thomas admits he ran away from his family and old mission in Iowa after feeling unfulfilled and stealing all the money from the youth group. Ellie secretly records his confession on her phone. Liz brings Mary, Charlie's ex-wife and Ellie's mother, to visit him and the truth about Ellie's secret meetings with her father is revealed. A heated exchange occurs where Charlie reveals he has $120,000 in his bank account. As Charlie had lied to her about not having money for healthcare, Liz angrily storms out, leaving Mary and Charlie alone to argue about the breakdown of their marriage and their failures as parents. As Mary leaves, Charlie tearfully admits he needs to know there is at least one thing he did right in his life. Charlie experiences a severe binge-eating episode after Dan glimpses him for the first time and sends out a profanity-laden email to his students asking them to write something honest. Thomas visits Charlie one last time, informing him that he is moving back home after Ellie sent his confession to his former youth group and family. His family has dismissed the incident and is welcoming him home. Thomas attempts to proselytize Charlie but is chastised after he blames Alan's death on his homosexuality. In his next class, Charlie reveals he's being replaced as their professor and reads some of their candid responses. To reciprocate their honesty, he switches on his webcam for the first time and the students film him disgustedly until Charlie ends the class by throwing his laptop against the fridge. Feeling guilty for abandoning him, Liz comforts Charlie as he nears death. Ellie storms into the apartment to confront him over his rewritten essay. Charlie reveals that he replaced her rewritten essay with a critical essay of Moby-Dick that she wrote in eighth grade as he considered it the most honest essay he's ever read. Ellie tearfully rebukes Charlie as he attempts to reconcile one final time. He asks her to read the essay to him. Ellie reads the essay as Charlie stands up and attempts to walk toward her, something he had tried but failed to do during Ellie's first visit. As Ellie completes the reading, Charlie begins to float and they are engulfed by a great white light. As it clears, the final shot shows a memory of the both of them visiting the beach as a family."
    },
    {
      "id": "tt14208870",
      "rank": "16",
      "rankUpDown": "-4",
      "title": "The Fabelmans",
      "fullTitle": "The Fabelmans (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img15.avif",
      "crew": "Steven Spielberg (dir.), Michelle Williams, Gabriel LaBelle",
      "imDbRating": "7.7",
      "imDbRatingCount": "44922",
      "plot": "On the night of January 10, 1952, in Haddon Township, New Jersey, Jewish couple Mitzi and Burt Fabelman take their young son Sammy to see his first film: Cecil B. DeMille's The Greatest Show on Earth. Dazzled by a scene involving a train, Sammy asks for a model set for Hanukkah, which he crashes late one night. Mitzi, understanding Sammy's intentions, allows him to shoot another crash scene using Burt's 8mm camera. Sammy soon begins filming regularly, sometimes involving his younger sisters Reggie, Natalie, and Lisa in his shoots. Burt is offered a new job in Phoenix, Arizona, and he and the family move there in early 1957; at the insistence of Mitzi, Burt's best friend and business partner Bennie Loewy goes with them. Years later, a now-teenage Sammy continues making films with his friends in a Boy Scout troop, during which he begins utilizing post-production effects and subsequently earns a badge in photography. Later, the Fabelmans, including Bennie, take a camping trip with Sammy capturing footage of their vacation. One night of the trip, Mitzi starts dancing in her nightgown in the dark. Burt tells Sammy to film her dancing, and when Sammy responds that there isn’t enough light, Bennie turns on car headlights, providing enough light but also backlighting Mitzi’s body through her nightgown. Shortly afterwards, Mitzi's mother dies from old age, leaving her especially distraught. Providing him with enough film editing equipment, Burt recommends that Sammy should turn the camping trip footage into a film in an effort to cheer Mitzi up, emphasizing that he should include Mitzi's dance. Sammy objects over the scheduling of his next film, but Burt, who sees Sammy's passion for film as nothing more than a hobby, argues that the home movie is more important. The next morning, the Fabelmans receive a surprise visit from Mitzi's uncle Boris, a former lion tamer and film worker. That night, he speaks with Sammy about compromising his family with art, telling him that both aspects will continue to be at odds with one another. After Boris leaves, Sammy begins editing the camping trip footage, during which he notices evidence of Mitzi and Bennie having an affair, leaving him angry. After weeks of harsh treatment towards her and Bennie, Sammy and Mitzi get into a heated argument. In a fit of rage over her son's behaviour, Mitzi slaps him across the back, forcing a distraught Sammy to show her the compiled footage. He promises to keep it a secret between them. The following week, Burt receives a promotion from work, requiring his family to move with him to Saratoga, California. In order to keep their marriage intact, Bennie stays in Phoenix, but not before gifting Sammy a new film camera. Sammy continuously refuses the camera in light of falling out with Bennie until he lets him pay $35 for it. Despite purchasing the camera, Sammy announces he will never use it. Soon after arriving in his new neighborhood and school, Sammy becomes targeted by students Logan and Chad, who levy anti-Semitic abuse toward him. Sammy also begins dating the devoutly Christian Monica. While having dinner with the Fabelmans, Monica suggests that Sammy film their Ditch Day at the beach, something Sammy considers and eventually accepts to do after Monica tells him her father owns a 16mm Arriflex camera that he would let him use. After finally moving from a rental to their newly purchased home, Mitzi and Burt announce their divorce due to the former's extreme depression and the latter's discovery of the affair, leaving the family, especially Sammy, heartbroken. During prom, Sammy declares his love for Monica and asks her to come with him to Hollywood after high school. Unable to throw away her own life's plans to attend Texas A&M University, Monica breaks up with Sammy, leaving him despondent. The Ditch Day film is played in front of Sammy's peers, where it receives a rapturous response. The film appears to glorify Logan and vilify Chad. When Logan confronts Sammy, confused over his positive portrayal in the film, the two reach an understanding until Chad attacks Sammy only for Logan to fight him off. The next morning, Mitzi and Sammy talk about their future together; just like Mitzi cannot give up her love for Bennie, she tells Sammy not to give up his love for filmmaking. The following year, Sammy is living with Burt in Hollywood. Unable to find work in the field, Sammy considers dropping out of college, but Burt, begrudgingly accepting his son's passion after seeing a photograph of Mitzi and Bennie together, tells him to keep on his path if it makes him happy. Sammy finally receives a letter from CBS, who offer him work on the sitcom Hogan's Heroes. Knowing that Sammy is more interested in filmmaking, a network executive invites Sammy to meet film director John Ford, one of his greatest filmmaking influences, who offers Sammy some brief pointers about framing. Newly invigorated, Sammy walks through the studio backlot as the camera frames the horizon to the center, contrary to Ford's advice, before ending by taking the advice and re-framing the horizon at the far bottom."
    },
    {
      "id": "tt14444726",
      "rank": "17",
      "rankUpDown": "-2",
      "title": "Tár",
      "fullTitle": "Tár (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img16.avif",
      "crew": "Todd Field (dir.), Cate Blanchett, Noémie Merlant",
      "imDbRating": "7.6",
      "imDbRatingCount": "30268",
      "plot": "Lydia Tár is an American pianist, ethnomusicologist, composer, and the first female chief conductor of the Berlin Philharmonic. During an interview at The New Yorker Festival, she promotes several new projects, including her upcoming live recording of Mahler's Fifth Symphony and new book Tár on Tár. She relies on Francesca, her personal assistant and ex-paramour, and Sharon, her wife and concertmaster. Lydia lunches with Eliot Kaplan, an investment banker and amateur conductor who co-founded the Accordion Foundation with Lydia to support aspiring female conductors. They discuss technique, replacing Lydia's assistant conductor Sebastian, and filling a vacant cello position in Berlin. Lydia guest-teaches a masterclass at the Juilliard School. She challenges a BIPOC pangender student for not taking interest in white cisgender composers like J. S. Bach, encouraging students to look past superficial differences and focus on the music itself. Before returning to Berlin, Lydia receives a first edition of Vita Sackville-West's novel Challenge from Krista Taylor, a former Accordion fellow. Dream sequences and e-mails suggest Lydia and Krista were in a sexually transactional relationship that went sour, with Krista becoming erratic after Lydia blacklisted her from various orchestras. Before a blind audition for the cello position, Lydia spots Russian hopeful Olga Metkina in the bathroom. Attracted to Olga, Lydia secures her favors, such as changing her scorecard to ensure a spot in the orchestra and granting a plum soloist position in the companion piece to Mahler's Fifth, Edward Elgar's Cello Concerto. As Lydia prepares for the recording, her relationships with Francesca and Sharon grow strained, as both recognize her attraction to Olga. After sending increasingly alarming emails to Francesca, Krista commits suicide and Lydia instructs Francesca to delete any correspondence from or about Krista. Lydia also retains a lawyer, as Krista's parents plan to sue. Lydia informs Sebastian of his imminent replacement. Incensed, he indicates the orchestra is aware of her favoritism, and that it suggests abusive behavior toward young women. He speculates Francesca will be his replacement, implying an exchange of sexual favors. Unnerved by the accusations, Lydia plans to replace Sebastian with a different candidate. Lydia is haunted by screaming women in the distance, nightmares, chronic pain, an increasing sensitivity to sound, and enigmatic scribbles resembling those Krista once made. While trying to complete a new composition, she is continually disturbed by the sound of a medical-alert device next door, where her erratic neighbor is caring for her dying mother. An edited, out-of-context video of Lydia's Juilliard class goes viral, and an article with predatory accusations against her appears in the New York Post. Lydia, accompanied by Olga, returns to New York to attend a deposition for the lawsuit of Krista's parents and to promote her book, where she is met by protestors. During the deposition, it is implied that Francesca has shared incriminating emails with the plaintiffs. Back in Berlin, Lydia is removed as conductor due to the controversy. Furious over the allegations and Lydia's lack of communication, Sharon bars Lydia from seeing their daughter Petra. Lydia retreats to her old studio and grows increasingly depressed and deranged. She sneaks into the live recording of Mahler's Fifth and violently assaults her replacement, Eliot. Advised to lie low by her management agency, she returns to her childhood home on Staten Island, where certificates of achievement reveal that her birth name is Linda Tarr. She tearfully watches an old tape of Leonard Bernstein's first episode of Young People's Concerts, 'What Does Music Mean?' Her brother Tony comes home and admonishes her for forgetting her roots. Sometime later, Lydia finds tedious and professionally undemanding work conducting in the Philippines. Seeking a massage to ease her jetlag, she asks the hotel concierge for a recommendation. She is sent to a high-end brothel, where she is directed to the 'fishbowl,' where numerous young women in numbered robes are seated in a chamber-orchestra-like arrangement. One woman looks up into Lydia's eyes, her robe the number 5, the same number as the important symphony Lydia couldn't conduct and her position the same as Olga's, and Lydia rushes outside to vomit. With her new orchestra, Lydia conducts the score for the video game series Monster Hunter in front of an audience of cosplayers."
    },
    {
      "id": "tt9686790",
      "rank": "18",
      "rankUpDown": "+33",
      "title": "Shotgun Wedding",
      "fullTitle": "Shotgun Wedding (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img17.avif",
      "crew": "Jason Moore (dir.), Jennifer Lopez, Josh Duhamel",
      "imDbRating": "5.5",
      "imDbRatingCount": "11789",
      "plot": "Tom, Darcy and their families gather for an ultimate destination wedding on a private island in the Philippines. Just as the couple are away arguing about the wedding, their guests are taken hostage. The pirates demand $45 million dollars from Darcy's wealthy father Robert. He refuses to pay until he is assured that Darcy is alive. Darcy and Tom are captured apart from the wedding party, but manage to escape their captors, killing one of the pirates. As they try to evade recapture, Darcy and Tom air their respective doubts about the wedding. Cornered hiding in a vault beneath the manager's office, Tom surrenders to them so Darcy can stay hidden. When he rejoins the rest of the wedding party, Tom reveals that Darcy's ex-fiancé Sean had hired the pirates. With his plot exposed, Sean goes to hunt down Darcy, taking Robert's girlfriend Harriet as a hostage. Meanwhile, Darcy joins Tom and the rest at the pool where she and Tom admit that they still want to marry each other. The wedding party members realize that Harriet was in on the plot with Sean. Tom convinces the two pirates standing guard to let them complete the wedding ceremony. Darcy's dad said he would release the money if they let them get married. As the guests sing 'I'll Be', Tom and Darcy rush the pirates, and Darcy takes a grenade off of one. One pirate surrenders; the other runs off, then begins firing on the venue. Tom's mother Carol grabs a weapon from the ground and returns fire. Darcy throws the grenade in the air so Tom can bat it at the pirate, who is blown up in the explosion (which also sets off the fireworks that had been staged for the wedding celebration). As the wedding party goes to safety, Darcy and Tom race to get help, but are confronted on the dock by Sean. Tom fights him, then Tom and Darcy escape in a boat. Harriett tries to stop them in a helicopter. Sean, who had been dragged by a rope with the boat, climbs aboard and fights Tom again while Darcy drives the boat. A parasail is released, taking Tom and Sean into the air. Tom zips down the line to the boat deck. Tom and Darcy cut the line, sending the parasail loose into the helicopter's rotors, which kills both Sean and Harriet. Back on the beach, as authorities take the remaining pirates into custody, Tom and Darcy get married."
    },
    {
      "id": "tt1016150",
      "rank": "19",
      "rankUpDown": "+18",
      "title": "All Quiet on the Western Front",
      "fullTitle": "All Quiet on the Western Front (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img18.avif",
      "crew": "Edward Berger (dir.), Felix Kammerer, Albrecht Schuch",
      "imDbRating": "7.8",
      "imDbRatingCount": "124479",
      "plot": "In 1917, three years into the First World War, 17-year-old Paul Bäumer enlists in the Imperial German Army alongside his school friends, Albert Kropp, Franz Müller and Ludwig Behm. They listen to a patriotic speech by a school official and unknowingly receive uniforms from soldiers killed in a previous battle. After they are deployed in Northern France near La Malmaison, they are befriended by Stanislaus 'Kat' Katczinsky, an older soldier. Their romantic view of the war is shattered by the realities of trench warfare on the Western Front, and Ludwig is killed by artillery on the first night. On November 7, 1918, German official Matthias Erzberger, weary of mounting losses, meets with German High Command to persuade them to begin armistice talks with the Allied powers. Meanwhile, Paul and Kat steal a goose from a farm to share with Albert, Franz, and another veteran, Tjaden Stackfleet, with whom they have grown close behind the front in Champagne. Kat, who is illiterate, gets Paul to read him a letter from his wife and worries that he will not be able to reintegrate into peacetime society. Franz spends the night with a French woman and brings back her scarf as a souvenir. On the morning of November 9, General Friedrichs drives Erzberger and the German delegation to a train bound for the Forest of Compiègne to negotiate a ceasefire. Paul and his friends go on a mission to find 60 missing recruits sent to reinforce their unit and discover that they were killed by gas after taking off their masks too soon. Friedrichs, who opposes the talks, orders an attack before French reinforcements arrive. That night, Erzberger's delegation reaches the Forest of Compiègne, and Paul's regiment is sent to the front to prepare to attack the French lines. On the morning of November 10, Ferdinand Foch, the Supreme Allied Commander, gives 72 hours for the Germans to accept the Allied terms, with no room for negotiation. Meanwhile, the German attack takes the French front line after hand-to-hand fighting but is routed by a combined arms counterattack with Saint-Chamond tanks, aeroplanes, and flamethrowers. Franz is separated from the group, and Albert is killed trying to surrender. Trapped in a crater in no man's land with a French soldier, Paul stabs him and watches him die slowly, becoming remorseful and asking for forgiveness from his dead body. Erzberger learns of Kaiser Wilhelm II's abdication and receives instructions in the evening from field marshal Paul von Hindenburg to accept the Allied terms. Paul returns to his unit and sees them celebrating the imminent end of the war. He finds a wounded Tjaden, who gives him Franz's scarf. Paul and Kat bring him food but Tjaden, distraught at being crippled, fatally stabs himself in the throat using a fork Paul and Kat brought with the food. Around 5:00 AM on November 11, Erzberger's delegation signs the armistice set to take effect at 11:00 AM. After learning of the ceasefire, Paul and Kat steal from the farm one last time, but Kat is shot by the farmer's young son and dies as Paul carries him to the hospital. Friedrichs wants to end the war with a German victory and orders an attack to start at 10:45 AM. A despondent, battle-hardened Paul kills many French soldiers before being speared through the chest by a bayonet seconds before 11:00 AM when the fighting stops, and the front falls silent. A short time later, a newly arrived German recruit that Paul had saved in the combat finds Paul's mud-caked body and picks up Franz's scarf."
    },
    {
      "id": "tt7405458",
      "rank": "20",
      "rankUpDown": "-10",
      "title": "A Man Called Otto",
      "fullTitle": "A Man Called Otto (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img19.avif",
      "crew": "Marc Forster (dir.), Tom Hanks, Mariana Treviño",
      "imDbRating": "7.6",
      "imDbRatingCount": "12614",
      "plot": "Otto Anderson, a 63-year-old widower, lives in suburban Pittsburgh, Pennsylvania. After retiring from a steel company, he plans suicide, having lost his wife Sonya, a schoolteacher, six months previously. During a suicide attempt by hanging, he is interrupted by his new neighbors: Marisol, Tommy, and their two daughters, Abby and Luna. Otto has flashbacks to his past; years previously he tried to enlist in the army but was unable due to having hypertrophic cardiomyopathy. He meets Sonya on a train after returning a dropped book to her. Otto attempts suicide again, this time via carbon monoxide poisoning. He experiences a flashback of him having dinner with Sonya, confessing to her that he is not enlisted in the army due to his heart condition and doesn’t have a job, making Sonya kiss Otto. Marisol disrupts Otto’s suicide attempt, asking him to take her and the kids to the hospital after Tommy fell and broke his leg using a ladder that Otto lent to him. He reluctantly agrees. Otto has a flashback to his graduation with an engineering degree, when he asked Sonya to marry him. During a suicide attempt by train, an old man faints and falls on the railroad tracks. Otto saves the man and the incident becomes a viral video. Otto then takes in a stray cat, which he had found to be an annoyance. Otto takes Marisol for a driving lesson and they visit Sonya's favorite bakery, which the couple formerly frequented every weekend. There, he tells her about his friendship with a guy named Reuben, the two having worked together to establish rules and order, with Otto as chairman of the neighborhood association board. The two grew apart after Reuben's preference for Fords and Toyotas over Otto's Chevrolets and the 'coup' of replacing Otto as chairman. Reuben, who suffered a stroke, is now confined to a wheelchair and is cared for by his wife Anita and neighbor Jimmy. A local transgender teen, Malcolm, recognizes Otto as Sonya's husband while delivering newspapers and circulars in the neighborhood. Malcolm cuts through Otto's disgruntlement at receipt of the newspapers when he recognizes Otto as 'Mr Anderson' and recounts that Sonya was his teacher and one of the few people who accepted him as he was. A friendship forms between the pair and Otto fixes Malcolm's bicycle. After dodging a social media journalist named Shari Kenzie who is attempting to interview Otto in relation to the earlier viral video, he gets angry at both Marisol and a Dye & Merika real estate agent, not wanting to come to terms with Sonya’s death. He attempts to commit suicide by shotgun, but is interrupted by Malcolm, who asks to spend the night after his father kicked him out. Otto learns that Dye & Merika is planning to force Reuben into a nursing home and take their house, after illegally finding out that Anita was diagnosed with Parkinson's disease. Otto agrees to help Anita and Reuben. Marisol refuses to assist Otto until he tells her that he and Sonya went to Niagara Falls to celebrate having their first pregnancy. On their way back home, the bus they were on crashed due to faulty brakes, resulting in Sonya being paralyzed and having a miscarriage. The neighborhood was not accessible to Sonya and Otto was voted out of the chairmanship after having a heated confrontation with a Dye & Merika representative. Otto wanted to put all of the real estate companies out of business but decided against it to care for Sonya. With the help of the neighborhood and Shari Kenzie, Reuben and Anita are able to keep their home. Otto collapses and is taken to the hospital, where he lists Marisol as his next of kin. After being told by a cardiologist that Otto’s heart is too big, she laughs, before going into labor, giving birth to a son. Otto gives his old car to Malcolm and takes Marisol and her kids for a drive in his new Silverado EV. Years pass and Otto becomes good friends with Marisol and her family. One day, Tommy notices that Otto didn’t shovel the snow on his walkway. Marisol and Tommy enter Otto's house to find him dead, having succumbed to his enlarged heart. A funeral is held, attended by his neighbors. In a letter to Marisol, Otto says that his lawyer will give her his bank accounts, providing them with enough money to take care of her family, as well as giving his new car and his house to her."
    },
    {
      "id": "tt19770238",
      "rank": "21",
      "rankUpDown": "+8",
      "title": "Aftersun",
      "fullTitle": "Aftersun (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img20.avif",
      "crew": "Charlotte Wells (dir.), Paul Mescal, Frankie Corio",
      "imDbRating": "7.8",
      "imDbRatingCount": "29715",
      "plot": "Eleven-year-old Sophie takes a summer holiday to Turkey with her loving and idealistic but troubled 30-year-old Scottish father Calum. Sophie is a curious, intelligent and observant girl, grappling with her burgeoning feelings of growth and the onset of her adolescence as she observes the teenagers on the Turkish resort engage in and discuss sexual and romantic activity. Sophie records the trip on a MiniDV camera, footage of which is interspersed with the main narrative. Calum exhibits signs of depression and general detachment, which he tries to hide from his daughter, keeping up a façade of contentment during the holiday. He is amicably separated from Sophie’s mother and is dealing with occupational and financial struggles. In his time alone on the holiday he is seen engaging in Tai chi patterns and reading self-help books. Sophie’s observant nature allows her to recognise that her father is dealing with a plethora of adult things she fails to understand. On one occasion, they go scuba diving and she loses her expensive scuba mask to the sea. Calum feigns nonchalance, but Sophie can sense that her father is upset by her mistake, expresses that she understood the mask was expensive, and comforts her father. Calum then confesses to the diving instructor next to them that he’s surprised that he made it to the age of 30, and is not expecting to make it to 40. In another instance, Calum and Sophie go to a rug merchant and she observes him grapple with the cost of purchasing one he likes. At first, Calum, Sophie with him, declines purchasing the rug. Later, without Sophie, he returns and buys the rug from the merchant despite the high cost. Later that night, they attend a karaoke night and Sophie signs her and Calum up for a song. Calum curtly refuses to sing with Sophie despite his daughter’s insistence, and Sophie goes on-stage alone. She then sings the lyrics of “Losing My Religion” alone as Calum watches on. Sophie’s perceptiveness surprises Calum and inadvertently causes him to become more depressed. But later, Calum and Sophie share a dance together to the music of 'Under Pressure' that brings them together for one of their last times in a loving embrace. Interspersed throughout the film are strobe-lit dance rave sequences featuring a crowd of dancing people, Calum in a stupor dancing, and a confused Sophie, now as an adult, watching the rave unfold from afar. In these sequences, the adult Sophie attempts to close the distance between herself and Calum but fails multiple times, but when she finally reaches her father, she angrily pushes him over. Later, Calum and Sophie are at the airport, signalling the end of their holiday. He, waving goodbye, sends her off on her flight back home to her mother. Calum then turns around and walks down the hallway to the room of the dance rave. Twenty years later, Calum is not present in Sophie’s life, though the rug he purchased is on display in her apartment. The Sophie seen in the rave sequences, now the same age as her father during their holiday and a new parent herself, looks back and reflects on the trip to Turkey with her father. She pries through the video camera footage and her own memories of the trip to uncover and learn who Calum Paterson really was in life."
    },
    {
      "id": "tt2906216",
      "rank": "22",
      "rankUpDown": "+290",
      "title": "Dungeons & Dragons: Honor Among Thieves",
      "fullTitle": "Dungeons & Dragons: Honor Among Thieves (2023)",
      "year": "2023",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img21.avif",
      "crew": "John Francis Daley (dir.), Chris Pine, Michelle Rodriguez",
      "imDbRating": "",
      "imDbRatingCount": "0",
      "plot": "Dungeons & Dragons: Honor Among Thieves is an upcoming fantasy adventure comedy film directed by Jonathan Goldstein and John Francis Daley, who co-wrote the screenplay with Michael Gilio from a story by Chris McKay and Gilio. Based on the tabletop role-playing game Dungeons & Dragons, it is set in the Forgotten Realms campaign setting and has no connections to the film trilogy released between 2000 and 2012. The film stars Chris Pine, Michelle Rodriguez, Regé-Jean Page, Justice Smith, Sophia Lillis, and Hugh Grant. Production of the film went through various phases in development since 2013, beginning with Warner Bros. Pictures after beating Hasbro and Universal Pictures in a lawsuit over the film rights to the tabletop role-playing game, before moving to Paramount Pictures, each with various writers and directors. Goldstein and Daley were the final writers/directors, using elements from the previous attempt by director Chris McKay and screenwriter Michael Gilio. Filming began in April 2021 in Iceland and later Northern Ireland. The film is set to premiere at South by Southwest on March 10, 2023, and is scheduled to be released in the United States on March 31, 2023 by Paramount Pictures."
    },

    {
      "id": "tt1745960",
      "rank": "23",
      "rankUpDown": "-3",
      "title": "Top Gun: Maverick",
      "fullTitle": "Top Gun: Maverick (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img22.avif",
      "crew": "Joseph Kosinski (dir.), Tom Cruise, Jennifer Connelly",
      "imDbRating": "8.3",
      "imDbRatingCount": "512799",
      "plot": "More than 30 years after graduating from Top Gun, United States Navy Captain Pete 'Maverick' Mitchell is a test pilot. Despite many achievements, repeated insubordination has kept him from flag rank; his friend and former Top Gun rival, Admiral Tom 'Iceman' Kazansky, now commander of the Pacific Fleet, often protects Maverick. Rear Admiral Chester 'Hammer' Cain plans to cancel Maverick's hypersonic 'Darkstar' scramjet program in favor of funding drones. To save the program, Maverick unilaterally changes the target speed for that day's test from Mach 9 to the final contract specification of Mach 10. However, the prototype is destroyed when he cannot resist pushing beyond Mach 10. Iceman again saves Maverick's career by assigning him to the Top Gun school at NAS North Island for his next assignment, but Cain tells Maverick that the era of manned fighter aircraft will soon be over. The Navy has been tasked with destroying an unsanctioned uranium enrichment plant before it becomes operational. It is located in an underground bunker at the end of a canyon. It is defended by surface-to-air missiles (SAMs), GPS jammers, and fifth-generation fighters as well as older F-14 Tomcats. Maverick devises a plan employing two pairs of F/A-18E/F Super Hornets armed with laser-guided bombs, but instead of participating in the strike, he is to train an elite group of Top Gun graduates assembled by Air Boss Vice Admiral Beau 'Cyclone' Simpson. Maverick dogfights his skeptical students and prevails in every contest, winning their respect. Lieutenants Jake 'Hangman' Seresin and Bradley 'Rooster' Bradshaw—son of Maverick's dead best friend and RIO Nick 'Goose' Bradshaw—clash: Rooster dislikes Hangman's cavalier attitude, while Hangman criticizes Rooster's cautious flying. Maverick reunites with former girlfriend Penny Benjamin, to whom he reveals that he promised Rooster's dying mother that Rooster would not become a pilot. Rooster, unaware of the promise, angrily resents Maverick for dropping his Naval Academy application—impeding his military career—and blames him for his father's death. Maverick is reluctant to further interfere with Rooster's career, but the alternative is to send him on the extremely dangerous mission. He tells his doubts to Iceman, who has terminal throat cancer. Iceman advises that 'It's time to let go' and reassures him that both the Navy and Rooster need Maverick. After Iceman dies, Cyclone removes Maverick as instructor following a training incident in which an F/A-18F is lost. Cyclone relaxes the mission parameters, so they are easier to execute but make escape much more difficult. During Cyclone's announcement, Maverick makes an unauthorized flight through the course with his preferred parameters, proving that it can be done. Cyclone reluctantly appoints Maverick as team leader. Maverick flies the lead F/A-18E, accompanied by a buddy lazing F/A-18F flown by Lieutenant Natasha 'Phoenix' Trace and WSO Lieutenant Robert 'Bob' Floyd. Rooster leads the second strike pair, which includes Lieutenant Reuben 'Payback' Fitch and WSO Lieutenant Mickey 'Fanboy' Garcia. The four jets launch from an aircraft carrier, and Tomahawk cruise missiles destroy the nearby air base as they approach. The teams destroy the plant, but the SAMs open fire during their escape, as anticipated. Rooster runs out of countermeasures, and Maverick sacrifices his plane to protect him. Believing Maverick to be dead, the others are ordered back to the carrier. Defying orders, Rooster returns to find that Maverick ejected and is being targeted by an Mi-24 attack helicopter. After destroying the gunship, Rooster is shot down by a SAM and ejects. The two rendezvous and steal an F-14 from the damaged air base. Maverick and Rooster destroy two intercepting Su-57s, but a third attacks as they run out of ammunition and countermeasures. Hangman arrives in time to shoot it down, and the planes return safely. Later, Rooster helps Maverick work on his P-51 Mustang. Rooster looks at a photo of their mission's success, pinned alongside a photo of his late father and a young Maverick, as Penny and Maverick fly off in the P-51."
    },
    {
      "id": "tt9737876",
      "rank": "24",
      "rankUpDown": "+2432",
      "title": "Narvik: Hitler's First Defeat",
      "fullTitle": "Narvik: Hitler's First Defeat (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img23.avif",
      "crew": "Erik Skjoldbjærg (dir.), Kristine Hartgen, Billy Campbell",
      "imDbRating": "6.6",
      "imDbRatingCount": "6052",
      "plot": "By April, 1940, Narvik, a small town in northern Norway, routinely has 85% of the iron ore used by the Nazi Germany's war machine transported from its port. Attempts to disrupt this process over two months of fierce winter warfare cause Hitler to be handed his first major defeat."
    },
    {
      "id": "tt13669038",
      "rank": "25",
      "rankUpDown": "+25",
      "title": "Women Talking",
      "fullTitle": "Women Talking (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img24.avif",
      "crew": "Sarah Polley (dir.), Rooney Mara, Claire Foy",
      "imDbRating": "7.5",
      "imDbRatingCount": "3494",
      "plot": "A young woman sleeps alone, in bed. There are visible bruises and wounds on her hips and upper inner thighs—injuries sustained through rape. In 2010, the women and girls of an unnamed, isolated Mennonite colony discover that the men have been using cow tranquilizer to subdue and rape them. The attackers are arrested and imprisoned in a nearby city. Most of the men of the colony travel to oversee the bail, leaving the women by themselves for two days to determine how they will proceed. They hold a plebiscite to decide whether to stay and do nothing, stay and fight, or leave. The vote is tied between staying and fighting, and leaving. Eleven of the colony's women band together at a hayloft to come to a final decision, though Scarface, a 'do-nothing' woman, leaves the meeting after becoming disillusioned with the discussion, taking her hesitant daughter Anna and resistant granddaughter, Helena, with her. August, the colony's schoolteacher and one of two remaining men, joins the women to record the meeting, as none of the women have been taught to read or write. The second man is Melvin (formerly Nettie), a transgender man who after being raped doesn't speak, except to the younger children. Therefore, he is left in charge of watching over them, and warning the women of any outside developments. Salome, just back from a trip to gather antibiotics for her four year old daughter who was assaulted, remains adamant about staying and fighting, an opinion shared by Mejal. Ona, who is pregnant (after being raped), also suggests that they stay and, after winning the fight, create a new set of rules for the colony that would give the women equality. Mariche, Greta's daughter and Autje's mother, disagrees, believing that forgiveness is the only viable option. To defuse the conflict, Ona suggests that August create one document stating the pros and cons of leaving, and another document doing the same for staying. The meeting is adjourned. During the break, it is revealed that August is from an excommunicated family, but was recently granted permission to return so that he could be a teacher to the boys of the colony. He and Ona were good friends as children, and he has had feelings for her since. When the women are counted for the 2010 census, they learn that Klaas, Mariche's abusive husband, will return that evening to collect more bail money. The meeting resumes. Ona and Mejal change their minds in favor of leaving. Salome remains insistent upon fighting, angrily confessing that she would rather kill the men than put her daughter in further harm's way. However, she changes her opinion after being reminded by Agata, her mother as well as Ona's, of the principles of their faith. The only remaining unconvinced member is Mariche. An argument ensues between her and the rest of the women; it is revealed that she forgave her husband's abuse at Greta's urging. After Greta apologizes, Mariche agrees to leave. Their reasons for leaving are transcribed by August: to ensure the safety of their children, to be steadfast in their faith, and to have freedom of thought. They decide to try to take boys aged 15 years and younger with them, but will not force any boy over the age of 12. They prepare to leave at sunrise, concealing their plans from Klaas. August, at Ona's behest, posts the documents stating the pros and cons of leaving and staying on the walls as an 'artifact' of the women's time in the colony. He also declares his love to Ona, and gives her a map for the women to use. Before they can leave, Melvin tells Salome that her teenaged son Aaron has fled and hidden. He is found, but cannot be convinced to leave in enough time. Salome, breaking the rules of their departure, tranquilizes Aaron, forcing him to leave with them. She reveals this only to August, who understands and does not question her. He asks her to look after Ona, and, in turn, she asks him to teach the boys properly, so as to prevent any further violence."
    },
    {
      "id": "tt13560574",
      "rank": "26",
      "rankUpDown": "-12",
      "title": "X",
      "fullTitle": "X (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img25.avif",
      "crew": "Ti West (dir.), Mia Goth, Jenna Ortega",
      "imDbRating": "6.6",
      "imDbRatingCount": "110098",
      "plot": "In 1979, aspiring pornographic actress Maxine Minx embarks on a road trip through Texas with her producer boyfriend Wayne Gilroy, fellow actors Bobby-Lynne Parker and Jackson Hole, amateur director RJ Nichols, and RJ's girlfriend, Lorraine Day, to shoot an adult film for the booming theatrical pornography market. Bobby-Lynne and Jackson strike up a romance, while Lorraine is unimpressed with the film's content, and RJ attempts to make it seem like a serious cinematic piece. The group arrives at the farm of Howard and Pearl, an elderly couple in whose guest house the group intends to shoot the film The Farmer's Daughters. Howard is temperamental towards the group, brandishing a shotgun while Pearl silently stalks Maxine. As filming commences without Howard's knowledge, Maxine is invited inside the couple's home by Pearl, where they have a conversation. Pearl laments her age, expresses jealousy for Maxine's youth, and makes a sexual advance towards her. She later watches Maxine have sex with Jackson and is aroused. Pearl pleads with Howard to have sex with her, but he refuses, claiming his heart is too weak. Night falls, and the film crew relaxes in the guesthouse. Lorraine, keen to shed her reputation as a prude and intrigued by the film, asks to participate in the shoot. RJ is immediately opposed to the idea and accuses the group of putting her up to it, though they assure him that they did not and that Lorraine's choice to be in the movie falls on her alone, regardless of his feelings. RJ then films the scene of Lorraine and Jackson having sex. Frustrated with the change in the script and in shock by Lorraine's unfaithfulness, RJ sets out to leave the crew stranded at the farm while they are asleep, but he is stopped by Pearl, who attempts to seduce him. When he rebuffs her, she stabs him to death. Lorraine and Wayne notice RJ is missing and go searching for him. While he’s searching the barn, Pearl tricks and stabs Wayne in the eyes with a pitchfork. Lorraine is invited into the couple's house by Howard, who claims Pearl is missing and asks Lorraine to retrieve a flashlight from the basement. When Lorraine attempts to leave the basement, she discovers she has been locked in. After turning on the light, she discovers the rigid corpse of a male sex slave hanging from the ceiling. Howard approaches the guest house and asks Jackson to help him locate Pearl. Jackson finds a submerged car in a pond (belonging to the corpse in the basement) before Howard shoots him dead. Meanwhile, Pearl enters the guest house, climbs into Maxine's bed naked, and pets her. Maxine awakens and screams, causing Pearl to flee the house, which Bobby-Lynne witnesses. In the farmhouse, Lorraine uses a hatchet to try breaking through a panel in the basement door, but Howard attacks her, breaking her finger, and forces her back inside. Bobby-Lynne follows Pearl outside to the nearby lake and tries to guide her away from the water. Pearl angrily accuses Bobby-Lynne of being a whore before pushing her into the lake, where an alligator devours her. Maxine sees Pearl and Howard return to the guest house and hides under the bed. The elderly couple discusses the murders before having sex. Maxine manages to flee to the van, where she finds RJ's corpse and the tires slashed. Armed with a pistol from the glovebox, Maxine enters the farmhouse and frees Lorraine, who angrily blames Maxine for what has happened. Lorraine panics and runs out the front door, only to be shot by Howard. As Howard and Pearl begin moving the body, intent on framing the crew as intruders, the dying Lorraine moves, startling Howard, who has a heart attack and dies. Maxine retrieves the keys to Howard and Pearl's truck and attempts to shoot Pearl, but the pistol is not loaded. Pearl tries to shoot Maxine, who dodges the bullet, while the recoil from the shotgun causes Pearl to fall and break her hip. As Pearl lies injured outside the house, she begs Maxine for help. Maxine refuses, and as Pearl berates her, Maxine runs her over with the truck, crushing Pearl's head. Maxine drives away from the farm. The next morning, the police arrive at the house to retrieve the bodies. It is revealed that Maxine is the daughter of a fundamentalist Christian preacher, whose speeches frequently played on televisions throughout the film. The police discover RJ's camera and speculate about what it contains."
    },
    {
      "id": "tt22352848",
      "rank": "27",
      "rankUpDown": "+146",
      "title": "Jung_E",
      "fullTitle": "Jung_E (2023)",
      "year": "2023",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img26.avif",
      "crew": "Sang-ho Yeon (dir.), Lee Dong-Hee, Lee Ga-Kyung",
      "imDbRating": "5.4",
      "imDbRatingCount": "6097",
      "plot": "Jung_E portrays a desolated Earth in the 22nd century that is no longer habitable due to climate change, and humans are forced to live in man-made shelters built in space. As the humans settle in around 80 of those shelters, three of them declare themselves as the Adrian Republic, attack Earth and other shelters, and cause a civil war between the Allied Force and Adrian Republic. Captain Yun Jung-yi is a legendary mercenary of Allied Forces who led her team to countless successful missions against the Adrian Republic. She has a little daughter, Yun Seo-hyun, who suffers from a lung tumor, and Jung-yi became a mercenary to afford her daughter's medical treatments. The day Seo-hyun gets the surgery, Jung-yi fails her mission and ends up in a coma. Kronoid, an institute in charge of developing AI technologies, convinces her family to agree to clone her brain, promising that they will cover Jung-yi's treatments, her daughter's education and living expenses. Thirty-five years later in 2194, Kronoid clones Jung-yi's brain to develop an AI mercenary, code-named Jung_E. Dr. Yun Seo-hyun is the team leader of research project Jung_E and seeks to memorialize Jung-yi as a hero rather than a failure. Researchers at Kronoid have copied Jung-yi's brain data and put them in android bodies. Through simulations of Jung-yi's final mission, they try to extract combat memory data that could be used to develop an exceptional combat AI. Just like Captain Jung-yi failed her last mission, AI JUNG_E also fails in every simulation of the last mission. Seo-hyun learns that her childhood cancer has returned, and she only has three months left to live. She also learns through the chairman of Kronoid that there is no need to develop combat AI anymore because the Adrian Republic and Allied Forces are entering a treaty. With peace approaching, the company has decided to focus on household services. Seo-hyun discovers one of her team members with a scantily clad Jung_E robot in his apartment, but he claims that Kronoid has tasked him with investigating using the Jung_E models as sex toys. After the last simulation of project Jung_E, Seo-hyun escapes the facility with a Jung_E robot while other combat robots and security forces chase them. Kim Sang-Hoon, the project's director, is revealed to also be a robot with an AI brain. Kim shoots Seo-hyun as she and the Jung_E robot flee via elevated rail. The Jung_E robot fights him off, and he is destroyed when his part of the train falls to the ground. Seo-hyun urges Jung_E to leave her and survive. After surprising Seo-hyun by showing affection, Jung_E escapes and looks around on top of a rock in a mountain range."
    },
    {
      "id": "tt5884796",
      "rank": "28",
      "rankUpDown": "-15",
      "title": "Plane",
      "fullTitle": "Plane (2023)",
      "year": "2023",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img27.avif",
      "crew": "Jean-François Richet (dir.), Gerard Butler, Daniella Pineda",
      "imDbRating": "6.9",
      "imDbRatingCount": "6906",
      "plot": "Commercial pilot Brodie Torrance, a former RAF pilot, flies Trailblazer Airlines Flight 119 from Singapore to Honolulu via Tokyo. After his plane suffers damage from a storm in the South China Sea, he is forced to land his plane in what turns out to be Jolo island in the Philippines with the loss of a stewardess and an RCMP officer, who is accompanying fugitive homicide suspect Louis Gaspare. In New York City, the board of Trailblazer calls their crisis manager, Scarsdale. He dispatches a private military outfit to rescue the passengers, as the authorities are unwilling to send troops into the rebel-controlled island. Brodie goes off into the jungle to seek help, accompanied by Gaspare. At an abandoned warehouse, Brodie phones his superiors and daughter to tell their location, but is attacked by a rebel whom he subdues. They encounter a site used by the rebels to make ransom videos and race back to the plane, but are beaten to it by rebel leader Datu Junmar, who kills a Korean couple who try to escape and takes the surviving passengers and crew hostage, intending to secure large ransoms from their families. After the group leaves, Brodie and Gaspare overpower remaining rebels and force them to reveal the location of their lair. Before leaving, Brodie leaves a note for rescue teams telling them what happened. At the rebel hideout, Brodie and Gaspare kill the hostages' guards and sneak them onto a bus. Brodie decides to stay behind to distract the rebels. As he is about to be executed, the rescue team arrives, inflicting heavy casualties on Junmar's men. Back at the plane, Brodie and his copilot Samuel Dele manage to make the plane operational again and gather the hostages inside for takeoff as Scarsdale's group and Gaspare fight off Junmar's men. Gaspare chooses to stay behind to distract Junmar's forces and allow Scarsdale's team to board the plane, preventing an attempt by Junmar to blow up the plane with an RPG and later fleeing into the jungle with a bag of money brought by the mercenaries to pay for the hostages. The plane is too damaged and too low on fuel to make a long journey, but Brodie manages to land the plane at the neighboring island of Siasi, where they are finally rescued by government forces and where Brodie receives praise from the passengers and crew."
    },
    {
      "id": "tt13131232",
      "rank": "29",
      "rankUpDown": "+28",
      "title": "Mission Majnu",
      "fullTitle": "Mission Majnu (2023)",
      "year": "2023",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img28.avif",
      "crew": "Shantanu Bagchi (dir.), Sidharth Malhotra, Rashmika Mandanna",
      "imDbRating": "7.8",
      "imDbRatingCount": "36414",
      "plot": "Amandeep Singh IPS, a deep cover RAW field operative is activated in Pakistan on an undercover mission to investigate Pakistan's involvement in creating nuclear weapons. Along the way, he must join hands with Aslam Usmaniya and Raman Singh, two other RAW agents stationed in Pakistan. Although, it wasn't enough to just know the whereabouts of the nuclear factory, they had to provide physical evidence so that India could stop Israel from bombing the wrong location. During his journey, he has to balance his professional and personal life with his blind wife Nasreen."
    },
    {
      "id": "tt12593682",
      "rank": "30",
      "rankUpDown": "-14",
      "title": "Bullet Train",
      "fullTitle": "Bullet Train (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img29.avif",
      "crew": "David Leitch (dir.), Brad Pitt, Joey King",
      "imDbRating": "7.3",
      "imDbRatingCount": "279748",
      "plot": "Yuichi Kimura, 'The Father', boards a bullet train in Tokyo in search of his son, Wataru's, attacker. Meanwhile, guided by his handler Maria Beetle, operative 'Ladybug' is assigned to retrieve a briefcase full of cash from the same train, replacing a sick colleague, Carver. Ladybug is reluctant, as his recent string of bad luck during his jobs resulted in accidental deaths. Also on the train are two English assassin brothers codenamed 'Lemon' and 'Tangerine', who just rescued a man ('The Son') from kidnappers and are taking him and the briefcase to his father, a Russian-born Yakuza boss called 'The White Death'. During the trip, The Son is killed by poisoning. Ladybug discreetly steals the briefcase, but on his way off the train, is attacked by another assassin, codenamed 'The Wolf' who recognizes Ladybug from his wedding where his wife was killed. The Wolf mistakenly believes Ladybug to be one of their killers. Ladybug confusedly fights The Wolf, who accidentally kills himself with a deflected knife throw. Yuichi finds the person who attacked Wataru, a young woman codenamed 'The Prince', but she overpowers him. She explains that she pushed Wataru off a roof to lure Yuichi to the train as part of a plan to have him kill the White Death. To ensure his cooperation, she has a henchman holding Wataru hostage in the hospital. Ladybug, recognizing Lemon from a job in Johannesburg gone wrong, offers to return the case in exchange for being allowed to leave. Lemon suspects that Ladybug killed The Son, leading to a fight. Lemon is knocked unconscious during the fight, and privately discusses Ladybug's innocence to Tangerine, before splitting off to find him and frame him for the Son's murder. The Prince finds the briefcase, booby-traps it with explosives, and rigs Yuichi's gun to explode if fired. Ladybug encounters Tangerine, and after avoiding the White Death's men, kicks Tangerine off the train as the train departs, but he climbs back aboard from outside. Suspicious of the two, Lemon shoots Yuichi but collapses after drinking from a water bottle Ladybug had previously spiked with sleeping powder. The Prince shoots Lemon and conceals him and Yuichi in a bathroom. Ladybug encounters yet another assassin, 'The Hornet', who poisoned the Son and Wolf's wedding party with the venom of a boomslang snake. After a struggle, both are exposed to the venom, but only Ladybug receives an anti-venom that saves him. Tangerine runs into the Prince and notices one of Lemon's train stickers on her, realizing that she shot Lemon. Ladybug interrupts them, and Tangerine is killed before he can shoot the Prince. At the next stop, Yuichi's father, 'The Elder', boards the train. He recognizes the Prince and informs her that Wataru is safe, as the henchman has been killed by his guard. After she flees, the Elder tells Ladybug he will remain to confront the White Death, who killed his wife while taking over the Yakuza. Finding Yuichi and Lemon still alive, the four work together to make preparations to face the White Death. At Kyoto, Ladybug gives the White Death the briefcase. The Prince, revealed to be the White Death's daughter, fails to goad him into shooting her with the rigged gun. The White Death explains that everyone on the train was linked to the death of his wife. He hired them hoping they would kill each other, not knowing Carver was replaced. The White Death's henchmen open the briefcase, which explodes, knocking Ladybug and the White Death back onto the train. The White Death's remaining henchmen board and battle the assassins, while the Elder duels the White Death. The train crashes into downtown Kyoto. Emerging from the wreck, impaled with the Elder's katana, the White Death tries to kill Ladybug, but the rigged gun explodes in his face. The Prince threatens Ladybug, Yuichi, and the Elder with a machine gun but is run over by a fruit truck driven by Lemon, who fell off the train earlier. Maria arrives to retrieve Ladybug, while Japanese authorities begin to clean up the damage caused by the train crash."
    },
    {
      "id": "tt3704428",
      "rank": "31",
      "rankUpDown": "-7",
      "title": "Elvis",
      "fullTitle": "Elvis (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img30.avif",
      "crew": "Baz Luhrmann (dir.), Tom Hanks, Austin Butler",
      "imDbRating": "7.4",
      "imDbRatingCount": "172235",
      "plot": "On January 20, 1997, Elvis Presley's former manager, Colonel Tom Parker, is on his deathbed, having suffered a stroke. Nursing a gambling addiction that has left him destitute, he recounts how he first met Presley. Raised mostly by his doting mother Gladys, Presley spends his childhood in the poorest parts of Mississippi, finding an escape in the comic book adventures of Captain Marvel Jr. and especially in song. However, upon moving with his parents to Memphis, he is ridiculed by his peers due to his fascination with the African-American music of Memphis's Beale Street. At this time, Parker is a carnival 'huckster' who fancies himself a modern-day P. T. Barnum. Although partnered with country singer Hank Snow, Parker realizes Presley's crossover potential when he hears him 'sounding black' on 'That's All Right.' That night, he sees Presley at a 'Louisiana Hayride' performance, discovering a talented musician with intense sex appeal. Parker meets with Presley at the carnival and persuades him to let him take control of his career, beginning a meteoric ascent that sees the Presley family lifted out of poverty. The regional public is divided in their view of the singer. Feeling that Presley's music will corrupt white children and stoke racial hostility, the segregationist Southern Democrat Mississippi Senator James Eastland calls Parker to an informal hearing, during which he questions Parker about his mysterious past. After Presley's charged dance moves at a concert, he faces legal trouble. Parker persuades the government to draft Presley into the US Army instead. During his military service in West Germany, Presley is devastated by his mother's alcoholism-induced death. He finds solace when he meets Priscilla Beaulieu, the teenage daughter of a United States Air Force pilot. After his discharge, he resumes his film career and marries Priscilla years later. As the popular culture of the 1960s passes Presley by, the assassinations of Martin Luther King Jr. and Robert F. Kennedy devastate him. Although he wants to become more politically outspoken in his music, Parker only allows him to release frivolous feel-good songs for a Christmas special television. However, this does not dissuade him. His performance choices in the special, including the closing number, 'If I Can Dream,' are presented and perceived as acts of not only his past songs but also political commentary. Infuriated corporate sponsors threaten litigation, while a disgusted Parker believes Presley has been 'brainwashed by hippiess' Nevertheless, the show is highly successful. After the special, Presley headlines at the largest showroom in Las Vegas, the International Hotel, and resumes concert tours. Parker's control of Presley's life tightens up as he refuses Presley's request for a world tour despite initially promising him and manipulates him into signing a contract for a five-year Las Vegas casino residency. Presley's problematic behavior and prescription drug addiction overtake him, and a despondent Priscilla divorces him on his 38th birthday, taking their daughter Lisa Marie with her. Presley discovers the truth that Parker cannot leave the country because he is a stateless illegal immigrant named Andreas (Dries) van Kuijk, and fires him on September 3, 1973. Parker and Presley argue over the latter's $8 million debt to the former accumulated over the years. Parker convinces Presley of their symbiotic relationship, and while they rarely see each other afterward, Parker continues as his manager. Presley continues a rigorous schedule of shows that leaves him increasingly exhausted. In 1974, Presley expresses his greatest fear to Priscilla of being forgotten after he dies as he believes he hasn't achieved anything worthwhile. At one of his final shows on June 21, 1977, in Rapid City, South Dakota, Presley, now obese and pale, sings 'Unchained Melody' and ends the performance to thunderous applause. As he finishes his recollection, Parker dies in 1997, impoverished and alone, while Presley, who died on August 16, 1977, is beloved worldwide and is the best-selling solo artist in history, with his influence and legacy on music continuing to the present day."
    },
    {
      "id": "tt8946378",
      "rank": "32",
      "rankUpDown": "-15",
      "title": "Knives Out",
      "fullTitle": "Knives Out (2019)",
      "year": "2019",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img31.avif",
      "crew": "Rian Johnson (dir.), Daniel Craig, Chris Evans",
      "imDbRating": "7.9",
      "imDbRatingCount": "697575",
      "plot": "The family of Harlan Thrombey, a wealthy mystery novelist, attends his 85th birthday party at his Massachusetts mansion. The next morning, Harlan's housekeeper, Fran, finds him dead with his throat slit. Lieutenant Elliot and Trooper Wagner believe Harlan's death to be suicide, but private detective Benoit Blanc is anonymously hired to investigate. Blanc learns Harlan had strained relationships with his family; on the day of his death, Harlan threatened to expose his son-in-law Richard for cheating on his daughter Linda, cut off his daughter-in-law Joni's allowance for stealing from him, fired his son Walt from his publishing company, and had an altercation with his grandson Ransom. Unknown to Blanc, Harlan's nurse, Marta Cabrera, mixed up his medications, making her think she overdosed him with morphine, and was unable to find the antidote, apparently leaving Harlan only minutes to live. Wanting to save Marta's family from scrutiny (her mother being an undocumented immigrant), Harlan gave her instructions to create a false alibi and then slit his own throat. Harlan's mother saw Marta carrying out his instructions but mistook her for Ransom. Marta cannot lie without vomiting, so she gives accurate but incomplete answers when questioned. She agrees to assist Blanc's investigation and conceals evidence of her actions. When Harlan's will is read, Marta is the sole beneficiary, shocking and angering his family. Ransom helps Marta escape them, but he manipulates her into confessing to him; he offers help in exchange for some of the inheritance. The other Thrombeys try to persuade Marta to renounce the inheritance; Walt threatens to expose her mother's immigration status. Marta receives a blackmail note with a partial photocopy of Harlan's toxicology report. She and Ransom drive to the medical examiner's office, but it has burned down. Marta receives an email proposing a rendezvous with the blackmailer. Blanc and the police spot them, and after a brief car chase, Ransom is arrested; Blanc explains that Harlan's mother saw Ransom climbing down from Harlan's room the night he died. At the rendezvous, Marta finds Fran drugged. She performs CPR and calls an ambulance. She confesses to Blanc, though Ransom has already informed on her, and she decides to tell the family that she caused Harlan's death, which would invalidate the will under the slayer rule. Back at the mansion, Marta finds a copy of the full toxicology report in Fran's cannabis stash. She gives it to Blanc without reading it herself, and Blanc sees it shows little morphine in Harlan's system and interrupts Marta before she can confess. Blanc reveals his deductions to the detectives, Marta and Ransom: After Ransom learned Harlan was leaving everything to Marta, he swapped the contents of Harlan's medication vials and stole the antidote, so Marta would kill Harlan and thus become ineligible to claim the inheritance. But Marta gave Harlan the correct medication, subconsciously recognizing it, and she only thought she had poisoned him after reading the label. When the death was reported as a suicide, Ransom anonymously hired Blanc to expose Marta. Fran saw Ransom tampering with the crime scene and sent him the blackmail note. After Ransom realized Marta was not responsible for Harlan's death, but Marta still thought she was, he forwarded the letter to Marta and burned down the medical examiner's office to destroy evidence of her innocence. He overdosed Fran with morphine, intending for Marta to get caught with Fran's corpse. The hospital calls; Marta relays that Fran survived and will implicate Ransom; he scoffs that since his attempt to kill Fran failed, his lawyers will help him escape attempted murder charges. Marta vomits on him, revealing that she lied: Fran is dead. Realizing he has confessed to the murder, with Wagner recording the conversation, Ransom attacks Marta with a knife from Harlan's collection, which turns out to be a retractable stage knife. The police promptly arrest him. Linda finds a note from Harlan about her husband's adultery. Blanc tells Marta he suspected early on that she played a part in Harlan's death, noting a drop of blood on her shoe. As Ransom is taken into custody, Marta watches from the balcony of what is now her mansion, with the Thrombey family gathered outside."
    },
    {
      "id": "tt17663992",
      "rank": "33",
      "rankUpDown": "-15",
      "title": "Scream VI",
      "fullTitle": "Scream VI (2023)",
      "year": "2023",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img32.avif",
      "crew": "Matt Bettinelli-Olpin (dir.), Melissa Barrera, Courteney Cox",
      "imDbRating": "",
      "imDbRatingCount": "0",
      "plot": "Scream VI is an upcoming American slasher film directed by Matt Bettinelli-Olpin and Tyler Gillett, written by James Vanderbilt and Guy Busick, with original franchise writer and creator Kevin Williamson returning as executive producer. It will be the sixth installment in the Scream film series and will be a direct sequel to Scream (2022). The film stars Melissa Barrera, Jasmin Savoy Brown, Mason Gooding, Jenna Ortega, Hayden Panettiere, and Courteney Cox, who are all reprising their roles from previous installments. Dermot Mulroney, Henry Czerny, Samara Weaving, and Tony Revolori were later added to the cast. Franchise star Neve Campbell announced she would not be returning as Sidney Prescott due to not being pleased with the offer presented to her, making this the first film in the franchise not to feature the actress or character. Scream VI is set to be released in the United States on March 10, 2023, by Paramount Pictures."
    },

    {
      "id": "tt0499549",
      "rank": "34",
      "rankUpDown": "-15",
      "title": "Avatar",
      "fullTitle": "Avatar (2009)",
      "year": "2009",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img33.avif",
      "crew": "James Cameron (dir.), Sam Worthington, Zoe Saldana",
      "imDbRating": "7.9",
      "imDbRatingCount": "1315531",
      "plot": "In 2154, the natural resources of the Earth have been depleted. The Resources Development Administration (RDA) mines the valuable mineral unobtanium on Pandora, a moon in the Alpha Centauri star system. Pandora, whose atmosphere is inhospitable to humans, is inhabited by the Na'vi, 10-foot-tall (3.0 m), blue-skinned, sapient humanoids that live in harmony with nature. To explore Pandora, genetically matched human scientists use Na'vi-human hybrids called 'avatars.' Paraplegic Marine Jake Sully is sent to Pandora to replace his deceased identical twin, who had signed up to be an operator. Avatar Program head Dr. Grace Augustine considers Sully inadequate but accepts him as a bodyguard. While escorting the avatars of Grace and Dr. Norm Spellman, Jake's avatar is attacked by Pandoran wildlife, and he flees into the forest, where he is rescued by female Na'vi Neytiri. Suspicious of Jake, she takes him to her clan. Neytiri's mother, Mo'at, the clan's spiritual leader, orders her daughter to initiate Jake into their society. Colonel Miles Quaritch, head of RDA's security force, promises Jake that the company will restore the use of his legs if he provides information about the Na'vi and their gathering place, the giant Hometree, under which is a rich deposit of unobtanium. Learning of this, Grace transfers herself, Jake, and Norm to an outpost. Jake and Neytiri fall in love as Jake is initiated into the tribe. He and Neytiri choose each other as mates. When Jake attempts to disable a bulldozer threatening a sacred Na'vi site, Administrator Parker Selfridge orders Hometree destroyed. Despite Grace's argument that destroying Hometree could damage Pandora's biological neural network, Selfridge gives Jake and Grace one hour to convince the Na'vi to evacuate. Jake confesses that he was a spy and the Na'vi take him and Grace captive. Quaritch's men destroy Hometree, killing many, including Neytiri's father, the clan chief. Mo'at frees Jake and Grace, but they are detached from their avatars and imprisoned by Quaritch's forces. Pilot Trudy Chacón, disgusted by Quaritch's brutality, airlifts Jake, Grace, and Norm to Grace's outpost. Grace is shot during the escape. Jake regains the Na'vi's trust by connecting his mind to that of Toruk, a dragon-like creature feared and revered by the Na'vi. At the sacred Tree of Souls, Jake pleads with Mo'at to heal Grace. The clan attempts to transfer Grace into her avatar with the aid of the Tree of Souls, but she dies. Supported by new chief Tsu'tey, Jake unites the clan, telling them to gather all the clans to battle the RDA. Quaritch organizes a strike against the Tree of Souls to demoralize the Na'vi. Jake prays to the Na'vi deity Eywa via a neural connection with the Tree of Souls. Tsu'tey and Trudy are among the battle's heavy casualties. The Na'vi are rescued when Pandoran wildlife unexpectedly join the attack and overwhelm the humans, which Neytiri interprets as Eywa answering Jake's prayer. Quaritch, wearing an AMP suit, escapes his crashed aircraft and breaks open the avatar link unit containing Jake's human body, exposing it to Pandora's poisonous atmosphere. As Quaritch prepares to slit Jake's avatar's throat, he is killed by Neytiri, who saves Jake from suffocation, seeing his human form for the first time. With the exceptions of Jake, Norm, and a select few others, all humans are expelled from Pandora. Jake is permanently transferred into his avatar with the aid of the Tree of Souls."
    },
    {
      "id": "tt10954600",
      "rank": "35",
      "rankUpDown": "-13",
      "title": "Ant-Man and the Wasp: Quantumania",
      "fullTitle": "Ant-Man and the Wasp: Quantumania (2023)",
      "year": "2023",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img34.avif",
      "crew": "Peyton Reed (dir.), Paul Rudd, Evangeline Lilly",
      "imDbRating": "",
      "imDbRatingCount": "0",
      "plot": "Ant-Man and the Wasp: Quantumania is an upcoming American superhero film based on Marvel Comics featuring the characters Scott Lang / Ant-Man and Hope van Dyne / Wasp. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is intended to be the sequel to Ant-Man (2015) and Ant-Man and the Wasp (2018) and the 31st film of the Marvel Cinematic Universe (MCU). The film is directed by Peyton Reed, written by Jeff Loveness, and stars Paul Rudd as Scott Lang and Evangeline Lilly as Hope van Dyne alongside Jonathan Majors, Michelle Pfeiffer, Michael Douglas, Kathryn Newton, David Dastmalchian, William Jackson Harper, Katy O'Brian, and Bill Murray. In the film, Lang and Van Dyne are transported to the Quantum Realm along with their family and face Kang the Conqueror (Majors). Plans for a third Ant-Man film were confirmed in November 2019, with Reed and Rudd returning. Loveness was hired by April 2020, with development on the film beginning during the COVID-19 pandemic. The film's title and new cast members were announced in December 2020. Filming in Turkey began in early February 2021, while additional filming occurred in San Francisco in mid-June, ahead of principal photography starting at the end of July at Pinewood Studios in Buckinghamshire and ending in November. Ant-Man and the Wasp: Quantumania is scheduled to have its world premiere in Hollywood, Los Angeles on February 6, 2023, and will be released in the United States on February 17, 2023, as the first film of Phase Five of the MCU."
    },

    {
      "id": "tt15679400",
      "rank": "36",
      "rankUpDown": "+17",
      "title": "Knock at the Cabin",
      "fullTitle": "Knock at the Cabin (2023)",
      "year": "2023",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img35.avif",
      "crew": "M. Night Shyamalan (dir.), Dave Bautista, Jonathan Groff",
      "imDbRating": "6.0",
      "imDbRatingCount": "661",
      "plot": "Wen, a seven-year-old, is vacationing with her two fathers, Eric and Andrew, at their remote cabin in Burlington County, New Jersey. During her stay, Wen is approached by a mysterious stranger named Leonard. Initially charming, Leonard explains that he needs Wen and her parents' help to save the world. While the two spend time together catching grasshoppers, Wen becomes suspicious when three other people show up with makeshift weapons. Wen flees to warn Eric and Andrew, but the visitors break into the cabin before tying them up, with Eric sustaining a concussion. Leonard and his companions—Sabrina, Adriane, and Redmond—claim to have never met before this day and have no intention to harm the family, but in the last week, they have been compelled by visions and an unknown power to find the family. The group foresee an upcoming apocalypse in which Leonard claims oceans will rise, a plague will descend, the sky will fall, and finally an unending darkness will blanket the earth. This can only be averted if the family kills one of their own as a sacrifice. They are warned that, while they will survive the apocalypse, if they do not choose, they will be doomed to be the last people alive. Eric and Andrew believe the group is lying and the attack is rooted in hate and delusion. When the family refuses to choose, the visitors sacrifice Redmond by covering his head with a cloth and beating him to death with their weapons. A concussed Eric sees a figure of light as Redmond dies. On the TV, media reports devastating tsunamis, which Leonard says is the start of the apocalypse. Andrew recognized Redmond, who is actually Jeff O'Bannon, a homophobe who assaulted him in a bar years ago, for which he went to prison. Andrew believes Jeff tracked him down as revenge. Leonard, Sabrina, and Adriane question if Andrew is right and struggle with their guilt but maintain that they believe their visions. They reveal that Redmond's death has unleashed the first disaster. The next day, the intruders sacrifice Adriane as the family once again refuses to choose a sacrifice. The disasters continue as a deadly flu virus, to which children are particularly vulnerable, spreads across the globe. Andrew insists the disasters are coincidental and the visitors were anticipating pre-scheduled news broadcasting. Sabrina describes how she and the other visitors were led by their visions to find each other online. Andrew manages to escape, retrieves his gun from the car, and shoots at Sabrina until she flees. Andrew finds Redmond's wallet and proves to Leonard that he was Jeff. Injured from his attack and their tires slashed, Andrew believes the four came in a truck nearby and suggests they use it to escape. After Andrew and Eric lock Leonard in the bathroom, Sabrina breaks into the house and is fatally shot by Andrew. Leonard tricks Andrew into coming into the bathroom, thinking he escaped out of the window, and overpowers him, stealing the gun. Leonard sacrifices Sabrina, and the broadcasts shows spontaneous plane crashes taking place around the world. Realizing their time is almost up, Leonard takes the three onto the back deck as the sky begins to blacken. Leonard tells them that after his death they will only have minutes to decide before it is too late before slashing his own throat. Upon his death the skies darken, lightning bolts cause fires and more planes fall. Eric now believes that the events are real, and the intruders represent the Four Horsemen of the Apocalypse. Not wanting Wen to grow up in a destroyed world, Eric offers himself as the sacrifice. He reveals that in the light during Redmond's sacrifice he saw a vision of Andrew and an adult Wen. Eric feels that they were chosen to sacrifice their family because their family's love was pure. Andrew reluctantly shoots and kills Eric before lightning strikes set the cabin on fire. Andrew and Wen find the visitors' truck with belongings that corroborate their stories. They drive to a crowded diner nearby, where they watch news reports confirming that the disasters have subsided. Returning to the truck, the radio turns on and plays 'Boogie Shoes' by KC and the Sunshine Band, the song Eric played for them on their drive to the cabin."
    },

    {
      "id": "tt7693316",
      "rank": "37",
      "rankUpDown": "-4",
      "title": "Devotion",
      "fullTitle": "Devotion (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img36.avif",
      "crew": "J.D. Dillard (dir.), Jonathan Majors, Glen Powell",
      "imDbRating": "6.7",
      "imDbRatingCount": "12807",
      "plot": "In early 1950, Lieutenant Tom Hudner transfers to Fighter Squadron 32 (VF-32) at Quonset Point Naval Air Station, where he meets Ensign Jesse Brown, the only African American member of the unit. Hudner integrates well into the squadron, which is assigned F4U-4 Corsairs – powerful planes with a reputation for fatal accidents if not handled properly. After Brown's car breaks down, Hudner starts giving him rides and eventually meets his wife Daisy and their young daughter Pam. The Browns are doing well, but struggle with racist neighbors, and Brown has resorted to shouting racist abuse at himself in the mirror for motivation before missions. VF-32 passes their carrier tests with the Corsair and transfer to the USS Leyte, which is deployed to the Mediterranean Sea to deter Soviet aggression. Before they leave, Daisy has Hudner promise that he will be there for Jesse. On the voyage, squadron member Mohring is killed in a crash while attempting to land a Corsair. Hudner questions why Mohring did not follow instructions, but Brown explains that one cannot always follow directions – if Brown had solely done what he was told, he would have been stopped early in his career by the many racist superior officers who wanted him to fail. The unit has shore leave in Cannes, France, where Brown encounters actress Elizabeth Taylor on the beach and secures invitations for the squadron to a casino, impressing them. After Hudner gets in a drunken fight with a Marine who had previously harassed Brown, Brown tells Hudner not to fight his battles for him, but simply to be there for him. Brown is given an expensive watch by Leyte's black crewmen, who admire him for his work. The next day, the squadron is informed that war has broken out between North and South Korea, and Leyte is redeploying to support the South. In November 1950, VF-32 arrives in Korea and learns that Chinese troops have entered the war on the North Korean side and begun to push American forces back. The squadron deploys to destroy a pair of bridges on the Yalu River between China and North Korea, though they are only permitted to fire on the Korean side of the border. Brown and Hudner fight off a MiG-15 fighter jet while the others attack the bridges, but one remains standing. While Hudner orders a retreat in the face of anti-air fire from the Chinese side of the river, Brown disobeys him and attacks the bridge solo, successfully crippling it. Hudner's after-action report praises Brown but also mentions that he was acting against orders, which Brown tells Hudner will be used as an excuse to deny him promotions for the rest of his career, despite Hudner's attempt to revise the report. On another mission to support besieged Marines at Chosin Reservoir (including the Marine who earlier harassed Brown), Brown's Corsair is crippled, and he is forced to crash-land in a clearing in the mountains of North Korea. Hudner sees that Brown is alive but trapped in his cockpit and deliberately crashes his own plane in the clearing in order to aid Brown. Though he puts out an engine fire, Hudner is unable to extract the wounded Brown from the wreckage, and Brown dies shortly after a Marine helicopter arrives to assist him. Back on Leyte, Hudner's commander determines that it is too risky to attempt to recover Brown's body from the Chinese-controlled area, and VF-32 (minus the injured Hudner) is instead sent on a 'funeral flight' to destroy the downed Corsairs, with Brown's corpse still inside. Several months later, a heartbroken Hudner receives the Medal of Honor from President Harry Truman for his attempts to save Brown. Hudner speaks with Daisy after the ceremony and apologizes for failing to rescue her husband. Daisy remarks that she only made him promise to be there for Jesse, not to save him, and Hudner tells her that Jesse's final words were about how much he loved her. The film ends with a note that Brown's remains have never been recovered from North Korea, and that Hudner and Brown's families remain close friends to this day."
    },
    {
      "id": "tt8129806",
      "rank": "38",
      "rankUpDown": "+55",
      "title": "To Leslie",
      "fullTitle": "To Leslie (2022)",
      "year": "2022",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img37.avif",
      "crew": "Michael Morris (dir.), Andrea Riseborough, Allison Janney",
      "imDbRating": "7.1",
      "imDbRatingCount": "3232",
      "plot": "Leslie is a troubled and manipulative alcoholic from West Texas who won $190,000 in a local lottery, only to squander the winnings on liquor and drugs. Six years later, Leslie is destitute, living a peripatetic life in motels and on the streets. After being kicked out of a residential motel, she reunites with her estranged 20-year-old son James, who allows her to live with him under the provision that she not drink. Leslie soon steals money from James's roommate Darren, and James discovers liquor bottles under her bed, leading him to call his grandmother and Leslie's friend Nancy for help. Nancy and her boyfriend Dutch reluctantly allow Leslie to stay with them, but lock her out in the middle of the night when she visits the local bar and is spotted by Pete, one of their friends. Leslie sleeps outside next to a motel, where she is found at dawn by Sweeney, one of the proprietors. He orders her to leave, and she flees, leaving her suitcase behind. She is met outside a convenience store that night by Pete, who buys her food, but Leslie again flees when he attempts to make sexual advances toward her. Leslie returns to the motel in search of her suitcase, and the benevolent Sweeney impulsively offers her a job cleaning rooms in exchange for a small wage and boarding. Royal, who helps run the motel with Sweeney, is cold toward Leslie, whom he has known since childhood. Leslie is frequently unpunctual to her duties, and she continues to spend her earnings on alcohol, often going to bars. Late one night, Leslie drunkenly wanders to the home where she raised James, startling the family who now lives there. The homeowners phone Sweeney, who returns Leslie to the roadhouse. Disappointed by Leslie's lack of commitment, Sweeney intends to fire her, but he relents when she assures him she intends to change her ways. With nowhere left to turn, Leslie attempts to focus on her job and maintain sobriety as she suffers through alcohol withdrawal. Leslie and Sweeney develop a friendship, bonding over their mutual history of addiction. Leslie accompanies Sweeney to a fair, where he meets with his daughter and granddaughter. Leslie gets into a confrontation with Nancy at the fair, who lambasts her in front of Sweeney for having abandoned James when he was a child. Later that day, Leslie quits her job at the motel. She phones James at a laundromat, leaving a message telling him she loves him, then visits a bar, where she converses with a young man. She orders a beer, but decides not to drink it. Meanwhile, Sweeney searches for Leslie and arrives at the bar, but she has left. Leslie squats in an abandoned ice cream shop across the street from the motel and watches as Sweeney returns. In the morning, she awakens Sweeney and tells him she wants to renovate the ice cream shop. Ten months later, Leslie is sober, and with Sweeney and Royal's help, she has renovated the ice cream shop, which she has turned into a diner. On the opening day, Leslie receives no customers. Nancy arrives that evening at closing time, and Leslie accuses her of sabotaging the business's opening by telling the locals not to go. Instead of meeting Leslie with rage, Nancy apologizes to Leslie for not being emotionally present throughout Leslie's life. Nancy also surprises Leslie by revealing she has brought James with her. Royal and Sweeney prepare a meal for them, and the two embrace."
    },
    {
      "id": "tt13539646",
      "rank": "39",
      "rankUpDown": "+3111",
      "title": "The Wandering Earth II",
      "fullTitle": "The Wandering Earth II (2023)",
      "year": "2023",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img38.avif",
      "crew": "Frant Gwo (dir.), Andy Lau, Jing Wu",
      "imDbRating": "8.0",
      "imDbRatingCount": "4979",
      "plot": "As the Sun becomes an expanding red giant and threatens to engulf the Earth in 100 years, the United Nations, now renamed as the United Earth Government (UEG), decides to proceed with the Moving Mountain Project, the pilot program to build thousands of gigantic ion engines that can propel the Earth out of the Solar System towards another habitable star system. In doing so, the UEG shuts down and bans the Digital Life Project (DLP), a radical group who believe humanity's future is in digital immortality by developing mind uploading technologies, despite skepticism and increasingly violent protests from the public. The first phase of the Moving Mountain Project is to build and test an ion engine on the Moon. However, a series of terrorist attacks by well-armed DLP supporters on the UEG facilities in 2044 resulted in a hacked drone attack on the space elevator in Gabon, as well as a coordinated hijacking of the elevator vehicles by highly trained infiltrators, with the aim of destroying the Ark Space Station supplying the lunar operation. Although UEG trainee astronaut Liu Peiqiang and his fellow trainees manage to defeat the hijackers on their vehicles, both the space elevator and Ark station are critically damaged and crash down to Earth. To restore public faith in the Moving Mountain Project, Liu Peiqiang and other UEG engineers are sent to the moon to work on finishing construction of three lunar engines, which are prototypes to demonstration the function before installing the first engines on Earth. Along with this, computer engineer Tu Hengyu, who had previously worked on the Digital Life Project before it was banned, works on incorporating the new 550 Series quantum computer, which will both control the highly efficient automated construction of the engines, and also control the operation once the engines are to be tested. Tu, in his spare time, views a simulation of his daughter, who had died in a car crash; but due to the limitations of the computer, her digital consciousness can only live for two minutes before restarting. In the next 14 years, the UEG quells the DLP supporters, gathers resources and builds over 7000 engines that stop the Earth's rotation. The Moving Mountain Project is officially renamed as the Wandering Earth Project, and the three completed lunar engines start to propel the Moon away from Earth. In 2058, Tu Hengyu decides to upload the recorded consciousness of his deceased daughter into the latest 550W supercomputer. Immediately after doing this upload, the lunar engines fire and then explode, sending the Moon on a collision course towards Earth. To deal with the Moon crisis, the UEG initiates a backup plan that involves detonating all of the Earth's nuclear weapons on the lunar surface and triggering its implosion. The mission faces numerous setbacks due to the difficulties in nuclear code decryption, the flooding of Internet root server data centers that allow coordinated detonation control, and the short time window before the moon reaches the Roche limit and fragments into pieces which will destroy the Earth. After the code deciphering hits a deadlock, hundreds of astronauts over the age of 50 voluntarily sacrifice themselves in order to manually detonate the nukes. Liu narrowly survives the nuclear detonation, managing to pilot a capsule back to the Navigation Space Station. Meanwhile on Earth, Tu, who is sent to help reboot the flooded Beijing server, uploads a copy of his own recorded consciousness into the network before drowning. His digital self manages to reboot the last Internet server in time, activating the Earth engines en masse and moving the Earth away from the course of the lunar debris. The Wandering Earth Project then officially begins with the Earth's course towards Jupiter. In a mid-credits scene, Tu's digital self is addressed by the 550W artificial intelligence, who now goes by the personified name 'MOSS' ('550W' upside down). The now-sentient supercomputer reveals that they have been behind every crisis that has ever harmed humanity's efforts to save themselves, adding that it will also trigger many more in the future."
    },
    {
      "id": "tt14308636",
      "rank": "40",
      "rankUpDown": "-6",
      "title": "Bank of Dave",
      "fullTitle": "Bank of Dave (2023)",
      "year": "2023",
      "image": "https://raw.githubusercontent.com/flx-lander7/resources/main/img-bestMovies/img39.avif",
      "crew": "Chris Foggin (dir.), Phoebe Dynevor, Joel Fry",
      "imDbRating": "7.2",
      "imDbRatingCount": "3548",
      "plot": "The film is based on the real-life experiences of Dave Fishwick. It follows the story of a Burnley working class and self-made millionaire, who struggles to set up a community bank to help the town's local businesses to thrive. To do so, he must battle London's elite financial institutions and compete for the first banking licence in over 100 years."
    }
  ],
  "errorMessage": ""
}
